[{"condition":"","topic":"Structure","title":"Structure the content consistently","basic":"Make sure that your title hierarchy is consistent. This includes deciding which titles contain actual information and which only serve as structuring elements.","advanced":"If you need support in putting together your manuscript, consider using the editorial support services of the Publications Office. The support offered at the conceptual development stage includes:  identifying and articulating the objectives of your future publication, along with its key message, target audience and intended impact; choosing the optimal format and structure; establishing a robust promotion strategy.","resources":"85,111","contacts":"81","examples":""},{"condition":"","topic":"Structure","title":"Provide visualisations that help the reader orient themselves in the publication","basic":"Such a visualisation – usually in the form of a diagram – shows the main chapters or topics of the publication and how they relate to one another.","advanced":"A further diagram can be used to provide an overview over other, related publications.","resources":"","contacts":"","examples":"22"},{"condition":"2A || 3B","topic":"Structure","title":"Provide a section that introduces the data used in the publication","basic":"This section or chapter describes the content of the data, what it can and cannot measure and the methodology used to collect and process the data. This section might also provide a link to the main datasets or database.","advanced":"Present the metadata of the main dataset in a table or typographic layout. Consider differentiating between basic and more advanced metadata information.","resources":"","contacts":"","examples":"18"},{"condition":"","topic":"Structure","title":"Provide a reference list, a figure and a table list, a list of abbreviations, and a glossary","basic":"Some of these sections might be mandated by your organization. Nonetheless, it is good to consider if a section is missing, especially if it benefits the readers of this particular publication. ","advanced":"Provide a section that collects all the figures from the publication and their meta data (e.g., title, source, author, etc.)","resources":"","contacts":"","examples":"24,29"},{"condition":"3A || 3B","topic":"Structure","title":"Use text and visual elements in a way that enables a good reading flow","basic":"Maintain a balance between the amount of text and the amount of visualisations. There should always be more or less the same number of paragraphs between each visualisation.","advanced":"Try to keep text and visualisations that refer to each other as close as possible. Ideally, a paragraph introduces the visualisation, then the visualisation is presented, followed by another paragraph that describes additional details of the data. ","resources":"","contacts":"","examples":"25,26"},{"condition":"16B","topic":"Design and Style","title":"Consider creating a style guide specific to your organization","basic":"The Interinstitutional Style Guide is very broad and is focused mostly on publication structure and on writing rules. An organisation style guide can refine some of the general guidelines and specifiy additional rules for the visual style and tone of voice used in your communcations. ","advanced":"","resources":"102,103,96,101","contacts":"","examples":"10,11"},{"condition":"16C","topic":"Design and Style","title":"Find out if your institution has it's own style guide","basic":"Talk with your communications officer to find out if and what kind of style guide your organisation has. ","advanced":"","resources":"102,103,96,101","contacts":"","examples":"10,11"},{"condition":"16A && !17A","topic":"Design and Style","title":"Consider extending your style guide with a section on visual styles","basic":"A section on visual styles defines the visual appearance of all your communciation material. This includes fonts (also font weights and sizes) and colors. It can also include publication layouts, the style of user interface elements, and guidelines on how to use the logo. ","advanced":"","resources":"102,103","contacts":"","examples":"10,11"},{"condition":"16A && !17B","topic":"Design and Style","title":"Consider extending your style guide with a section on data visualization design ","basic":"A section on visualisation style defines font sizes and color palettes for data visualisation. Color palettes for data visualisation are different from normal brand colors in that they include color ramps, a set of categorical colors and multiples shades of each color for highlights. The guide can also define the design of visualisation details like the weight of the lines used in charts or the style of the chart axes. ","advanced":"","resources":"101,106","contacts":"","examples":"15,16,18"},{"condition":"16A && !17C","topic":"Design and Style","title":"Consider extending your style guide with a section on content design","basic":"A section on content design defines different types of texts used in your organisation, the tone in which you address the reader, the way you handle abbreviations, and your vocabularies.","advanced":"","resources":"96","contacts":"","examples":"12,13,14"},{"condition":"16A && !17D","topic":"Design and Style","title":"Consider extending your style guide with a section on data citation","basic":"","advanced":"","resources":"117","contacts":"","examples":""},{"condition":"16A","topic":"Design and Style","title":"Make sure your visual style guides consider accessibility","basic":"In particular, check if you are using reasonably large font sizes (a minimum of around 16px for online and 12pt for print for body text, depending on the font) and if your font colors have a high contrast to the background. ","advanced":"","resources":"88,105","contacts":"","examples":""},{"condition":"16A","topic":"Design and Style","title":"Make sure your data visualisation guides consider accessibility","basic":"Accessible data visualizations don't rely on color alone to encode information, provide alternative text that describes the visualisation, and label and annoate the visualisation directly. They also uses colors that have enough contrast to the background, are clearly distinguishable from each other, and account for different types of color blindness.  ","advanced":"","resources":"98,99,100,104,77","contacts":"79","examples":"17,19"},{"condition":"16A","topic":"Design and Style","title":"Make sure your guides on content design consider accessbility","basic":"Writing guidelines that consider accessibility include guidance on using simple, concise language, using headings to convey meaning and structure, making link text meaningful, and on writing text alternatives and captions for mulimedia content.","advanced":"","resources":"97,121","contacts":"","examples":"20"},{"condition":"16A","topic":"Design and Style","title":"Make sure your style guide includes guidelines on data citation","basic":"","advanced":"","resources":"117","contacts":"","examples":""},{"condition":"","topic":"Text","title":"Write for the web","basic":"Whether you are producing a PDF or a web-based publication, chances are your content will be read online on a range of devices, from large desktop screens to small mobile screens. To ensure a pleasant reading experience, it is important to create clear visual hierarchies, write in sentences that are short and concise, and break up your content into short paragraphs.","advanced":"Use the \"inverted pyriamid\" structure for you texts. In this story structure, the most important information is presented first and followed up with increasingly less important information. ","resources":"93,94,95,107","contacts":"","examples":"27"},{"condition":"","topic":"Text","title":"Write in plain language ","basic":"To ensure your text is comprehendable, use plain language. This means, knowing your audience and knowing which terms your audience understands, using short terms and paragraphs and aiming for a 10 to 12th grade reading level. ","advanced":"","resources":"88,89,125,126","contacts":"","examples":"27"},{"condition":"","topic":"Text","title":"Avoid repetition","basic":"Especially if the publication is written by multiple authors, repetitions are prone to happen. Ensure that there are no unnessecary repetitions by having an person in your project team who does not write themselves but acts as editor to the whole publication. ","advanced":"","resources":"","contacts":"","examples":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title":"Follow open data practices in preparing your data","basic":"Open data practices include using a machine-readable and non-proprierty file format, such as CSV or JSON.","advanced":"Consider applying FAIR principles (findable, accessible, interoperable, reusable).","resources":"53,56,56,57,58, 52,55","contacts":"62","examples":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title":"Use the right license for your data","basic":"The EC adopted the Creative Commons Attribution 4.0 International license (CC-BY 4.0) license as a default reuse instrument. This license allows users to \"copy, modify and distribute data in any format for any purpose, including commercial use. Users are only obligated to give appropriate credit (attribution) and indicate if they have made any changes, including translations.\" (Worldbank, 2020)\n\nMake sure to clearly state the license of your data in your publication. ","advanced":"Consider licences in the contract clauses while externalising data collection. In case of doubts consult the Copyright team of the Publications Office or the Central Intellectual Property service of the European Commission.","resources":"3,1,120","contacts":"5,6","examples":"28"},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title":"Describe your data in a standardized way","basic":"For people to be able to find and understand how your data was collectd, it's important to describe the most important aspects of your data. These descriptions are standardized to ensure compatibility. For metadata description use DCAT-AP (the Data Catalog Vocabulary of the EU), the Eurovoc thesaurus and EU reference data. ","advanced":"","resources":"47,68,48,123,67","contacts":"62","examples":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title":"Make sure that you provide enough documentation to your data","basic":"It is important to ensure that users can work with the data. The data documentation should include everything the user needs to know to work with the data, such as methodology, defintions, time ranges, and descriptions of the rows and columns. The documentation can be saved in a separate sheet in the Excel file that contains the actual data or be provided in a separate file. ","advanced":"","resources":"","contacts":"","examples":""},{"condition":"(3A || 2A) && (7C || 8C)","topic":"Data","title":"Find out if you can provide your data as open data","basic":"Follow Commission Decision of 12 December 2011 on the reuse of Commission documents  2011/833/EU","advanced":"Check data protection (GDPR/EUDPR) and licencing. In case of doubts contact your respective Local Data Correspondent ","resources":"","contacts":"27,5,62,13","examples":""},{"condition":"(3A || 2A) && (7B || 8B)","topic":"Data","title":"Check if any licences would apply to your data","basic":"Even if you can't fully publish your data as open data, it still makes sense to licencse it accordingly. ","advanced":"","resources":"3,1,120","contacts":"5,6","examples":""},{"condition":"(3A || 2A) && (7B || 8B)","topic":"Data","title":"Describe your data in a standardized way","basic":"Even if you can't fully publish your data as open data, it still makes sense to describe it in a standardized way for your own documentation. For metadata description use DCAT-AP (the Data Catalog Vocabulary of the EU), the Eurovoc thesaurus and EU reference data. ","advanced":"","resources":"47,68,48,123,67","contacts":"62","examples":""},{"condition":"(3A || 2A) && (7A || 8A) && 11A","topic":"Data","title":"Provide access to the data (for humans and machines)","basic":"Provide download or query possibility for your data. Link to the data from your publication. Be sure to maintain access to and curate those links to the data, i.e. ensure that the links are not broken. ","advanced":"Make it possible to download different parts of your data. This can include, the entire database, single datasets, and the data that is used in the visualisations (which has often been re-formated and aggregated for the visualisation).  This allows different types of users to reuse your data efficiently. ","resources":"","contacts":"","examples":""},{"condition":"(3A || 2A) && (7A || 8A) && 11A","topic":"Data","title":"Consider providing an API (Application Programming Interface) to the data","basic":"It allows for automatic, systematic and customised acquistion of data and linking them to other applications or databases","advanced":"Consider it especially for high value datasets. It's important to provide documentation of the API","resources":"","contacts":"","examples":""},{"condition":"(3A || 2A) && (7A || 8A) && 11B","topic":"Data","title":"Find out where you can store your data ","basic":"Consider solutions available in your service or DIGIT. In case of doubt consult your Local Data Correspondent","advanced":"Consider the whole life-cycle of data including archiving policy of your DG and long time preservation ","resources":"53","contacts":"62,18,13","examples":""},{"condition":"(3A || 2A) && (7A || 8A) && 11C","topic":"Data","title":"Learn about your institution's data management strategy","basic":"Talk with your data governance or IT-department to find out how data might be managed in your organisation, i.e. where data is stored and how it is stored. ","advanced":"","resources":"","contacts":"13","examples":""},{"condition":"3A","topic":"Visualisation","title":"Choose the right type of visualisation","basic":"Choose different visualisation types (e.g., bar chart, flow chart, diagram, etc.) depending on the data and on what aspects of your data you want to communicate.","advanced":"Once you have found the type you want to use (e.g. a line chart), make design amendments to communicate the information in your data more clearly (e.g. flip the chart 90 Degrees so that the lines run vertically). ","resources":"87,37","contacts":"","examples":"1"},{"condition":"3A","topic":"Visualisation","title":"Follow best data visualisation practices","basic":"This includes using titles that summarize the main point of the visualisation, sub-headings that describe the units of measurement, precise legends / keys, consistent axes, and appropriate colors. It can also mean showing missing data, uncertainty ranges, trendlines and benchmarks, if the data calls for it. ","advanced":"","resources":"33,30,55","contacts":"","examples":"1"},{"condition":"3A && !5D","topic":"Visualisation","title":"Show the data values in a static manner","basic":"Sometimes it might be important to know the exact value for each data point. In static visualisations, the data values can be shown directly on the chart. If there is not enough place to show all data values, annotate the chart with the most important ones (e.g., minimum, maximum and most recent value). ","advanced":"Provide the reader with a table view of the graphic. In a static publication format, the table can be shown below or next to the visualisation. ","resources":"","contacts":"","examples":"2,3"},{"condition":"3A && 5D","topic":"Visualisation","title":"Show the data values interactively","basic":"Sometimes it might be important to know the exact value for each data point. In interactive graphics a tool tip can be provided that shows the data values on hover. In addition, you can annotate the chart with the most important ones (e.g., minimum, maximum and most recent value).   ","advanced":"Provide the reader with a table view of the graphic. In an interactive publication, allow the reader to switch between the chart and the table view.","resources":"","contacts":"","examples":"2,4"},{"condition":"3A","topic":"Visualisation","title":"Clearly identify the author of the visualisation","basic":"Make sure to clearly identify the organisation (or person) that created the visualisation. Because your visualisations might be reused in different contexts, it is best to cite the author in each chart.","advanced":"Consider ensuring that your organisation's logo appears on the chart when downloaded.","resources":"","contacts":"","examples":"4,5"},{"condition":"3A","topic":"Visualisation","title":"Always cite the data source ","basic":"Whether it is your own data or data from a third-party, always clearly identify the source of the data that was used to create the visualisation. As your visualisations might be reused in different contexts, it is best to cite the source with each chart. If possible, add a link that leads directly to that data set or to information on that data set. ","advanced":"Be consistent in the way you cite the data source. For example, you might decide to consistently use the name of the data owner and a link to the page that describes that data set.\n\nIn a comparative report, provide the source for each data value. ","resources":"117","contacts":"","examples":"6,8"},{"condition":"3A && 9B","topic":"Visualisation","title":"Make sure to explicitly state that the visualisations cannot be reused ","basic":"","advanced":"","resources":"","contacts":"","examples":""},{"condition":"3A && 9C","topic":"Visualisation","title":"Check if it can be reused","basic":"","advanced":"","resources":"","contacts":"","examples":""},{"condition":"3A && 9C","topic":"Visualisation","title":"State reuse licence","basic":"","advanced":"","resources":"","contacts":"","examples":""},{"condition":"3A && 9A && 12A","topic":"Visualisation","title":"Provide your visualisations as downloads","basic":"Provide an image (best format: PNG) of the visualisation for people to download and reuse. This image should contain metadata about the visualisation, e.g. which institution created it, the year, and link to the data behind it.","advanced":"If you want the user to be able to edit the visualisation provide an open, vector-based format such as an SVG in addition to the closed, pixel-based formats such as PNGs and JPEGs.\n\nYou might also want to offer different aspect ratios, such as a 16:9 ratio for presentations and a 1:1 ratio for social media. \n\nUsers might want to download all the visualisations and visualised tables from the report at once. Provide a link to a zip-file with all files in different formats. ","resources":"","contacts":"","examples":"7,9"},{"condition":"3A && 5D && 9A && 12A","topic":"Visualisation","title":"Provide your interactive visualisations as downloads","basic":"Provide an image (a PNG or a JPEG) of the visualisation for people to download and reuse. This image should include metadata about the visualisation, e.g. which institution created it, the year, and link to the data behind it.","advanced":"If you want the user to be able to edit the visualisation provide an open, vector-based format such as an SVG in addition to the closed, pixel-based formats such as PNGs and JPEGs.\n\nYou might also want to offer different aspect ratios, such as a 16:9 ratio for presentations and a 1:1 ratio for social media. \n\nUsers might want to download all the visualisations and visualised tables from the report at once. Provide a link to a zip-file with all files in different formats. \n\nMake it possible to download the visualisation as it was filtered, sorted, and re-styled by the user: If the visualisation is interactive, the user might want to download the chart as they re-styled it, for example to use in a presentation or to post on social media.","resources":"","contacts":"","examples":""},{"condition":"3A && 9A && 12B","topic":"Visualisation","title":"Find out where you can store your visualisations ","basic":"Talk with your IT-department to find out where visualisation files are stored in your organisation.","advanced":"","resources":"","contacts":"","examples":""},{"condition":"3A && 9A && 12C","topic":"Visualisation","title":"Find out about your institution's file management strategy","basic":"Talk with your IT-department to find out how visualisation files might be managed in your organisation, i.e. where files are stored and how they are stored. ","advanced":"","resources":"","contacts":"","examples":""},{"condition":"3A && 5D","topic":"Visualisation","title":"Decide the level of interactivity for each chart","basic":"Many online charting tools come with integrated, default interactive features and sometimes also animations. These features do not always contribute to the legibility of the visualisations. It's always better to provide static, legible visualisations than distracting interactions that don't serve a purpose. ","advanced":"","resources":"","contacts":"","examples":""},{"condition":"3A && 5D","topic":"Visualisation","title":"Provide interactive chart functionalities","basic":"Provide options to change the data displayed in the visualisation and to sort and filter that data. ","advanced":"Provide options to change how the visualisation looks. The user might choose from different color palettes or change which data points are the highlighted.","resources":"","contacts":"","examples":""},{"condition":"3A && 5D","topic":"Visualisation","title":"Create visualisation designs for different screen sizes","basic":"Increasingly, content is consumed on smaller screens, i.e. mobile devices. This means that online content needs to responsively adjust to the screen size the reader is using. Data visualisations are no exception: They need to be designed for at least two different screen sizes (mobile and desktop) so that they remain legible across devices or be designed in a way that they responsively adjust to the width of the screen. ","advanced":"","resources":"","contacts":"","examples":""},{"condition":"3A && 5D","topic":"Visualisation","title":"Provide options to reuse your visualisation on the web","basic":"Provide an embed code for the visualisation so that users can add your chart to their websites. An embed code is a short script that can be copied and pasted into the code of another website. ","advanced":"Provide options to share the visualisation through share buttons. These allow people to share the visualisation directly on common social media platforms, e.g. instagram, twitter, facebook. \n","resources":"","contacts":"","examples":""},{"condition":"6A && (7B || 8B) || (7C || 8C)","topic":"Publishing","title":"Consider publishing the data in your organisation's internal data catalogue (e.g. EC data catalogue)","basic":"Even if the data cannot be released as open data, it is good practice to catalgue your data – either for internal or restricted public use. In case an internal data catalogue doesn't exist start with creating an inventory of your data.","advanced":"Data inventory and catalogue should use recommended standards (e.g. DCAT-AP, the data catalogue vocabulary for data portals in Europe)","resources":"24,21,9","contacts":"18","examples":""},{"condition":"6A && (7A || 8A)","topic":"Publishing","title":"Publish your datasets on data.europa.eu and your publications on OP portal","basic":"Use DemPub to introduce your request for publishing. Make sure to also include a request for data identifiers. By doing that the OP will ensure that you get unique identifiers for your publication and for your data. Your publication will be included in the EU publications catalogue, while your data will be included in the data.europa.eu catalogue.","advanced":"","resources":"84","contacts":"80","examples":""},{"condition":"6B && (7A || 8A) || (7C || 8C)","topic":"Publishing","title":"Consider aquiring identifiers through the Publications Office both for your data and for your publication","basic":"Even if you are not using the OP to publish your publication, you can still use OP services to get a unique identifier. Use DemPub to make an identifiers only request. ","advanced":"","resources":"84","contacts":"80","examples":""},{"condition":"6B && (7B || 8B)","topic":"Publishing","title":"Consider aquiring identifiers through the Publications Office for your publication","basic":"Even if you are not using the OP to publish your publication, you can still use OP services to get a unique identifier. Use DemPub to make an identifiers only request. ","advanced":"","resources":"84","contacts":"80","examples":""},{"condition":"6C","topic":"Publishing","title":"Consider publishing with the Publications Office ","basic":"The OP offers various additional and many free services related to publications and data. You may consult the online catalogue of OP services (PubliCare), and then request the ones you need using the platform DemPub.","advanced":"","resources":"83,84","contacts":"80","examples":""}]