[{"condition":"(3A || 2A) && (7B || 8B)","topic":"Prepare the Data","STATUS":"ADINA","order":"1","title":"If necessary, obtain the licences to use third-party data","why":"Data is protected by intellectual property rights. If you are using data that was not created by your own institution, it is important to get proper permission from the original owner to use it and to figure out if the data can be reused by others. ","how":"If you are not the data owner, make sure you obtain the permission to use it, and keep proof of this permission. The permission might take the form of a reuse licence. For example, CC BY 4.0 is a commonly used licence which means that you are allowed to use the data with proper attribution. If you cannot find the reuse licence, you might need to contact the original data owner. In the case that external contractors collect the data for you, make sure to explicitly mention the data as a deliverable. This way, the ownership and licensing modes of the publication will also apply to the data.  All third-party data must be explicitly mentioned in the publication’s copyright notice.","resources":"3,1,44","contacts":"5,6","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare the Data","STATUS":"ADINA","order":"2","title":"Licence your data so that others can reuse it","why":"A licence specifies the conditions under which others can reuse and share your data. To support people reusing your data, decide and communicate under which terms they can do so.\n","how":"Different EU institutions have different reuse policies. Check your institutions open data and/or reuse policy to find out which licences you can use. By default, all data owned by the European Commission is licensed under the Creative Commons licence CC BY 4.0. This licence allows anyone to adapt and share the data, even for commercial purposes. They must, however, give appropriate credit and indicate any changes. For raw data, metadata and similar material, you can also distribute the data under CC0 1.0 – a more permissive licence. Or, if there are reasons for you to be more restrictive, you can also choose another licence (see resources). In the case that you are using third-party data, the licence under which your readers can make use of this data, is defined by the original rightsholder. \n\nEven if you don't publish your data on an open data catalogue such as data.europa.eu but on an internal one (e.g., EC Data Catalogue), it still makes sense to licence it accordingly so that other people know what they can do with it. \n\nState the reuse licence in your publication’s copyright notice (see recommendation ‘State the reuse licence of the data in the copyright notice’) and in the metadata (see recommendation ‘Describe your data with metadata’). All third-party data must be explicitly mentioned in the copyright notice. In doubt, reach out to the OP Copyright team. ","resources":"3,120,7,1,44","contacts":"5,6","examples":"28","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare the Data","STATUS":"ADINA","order":"3","title":"Protect personal information before publishing your data","why":"Personal data is any information that relates to an identified or identifiable living individual, for example a name, address, e-mail address or registration number. The protection of personal data is a fundamental right. Such data can only be processed and published if the consequences that arise from doing so are justified (principle of proportionality).","how":"Data protection practices include anonymisation and pseudonymisation, as well as sharing data in closed circles, for example only with dedicated researchers. Data protection is a broad and complex topic. If you are working with any kind of personal data, we recommend contacting your Data Protection Coordinator (for Commission and Parliament) or Data Protection Officer (for the other EU institutions and bodies). Get in touch with them at an early stage in the drafting process.","resources":"158,25,44","contacts":"27","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare the Data","STATUS":"DONE","order":"4","title":"Decide on the scope of the data you will publish","why":"Data scope refers to the amount of aggregation the data has gone through. For example, you might have a large database of original study data, single data sets that analyse specific topics, and highly aggregated data tables that are used to create the visualisations. Providing the right amount of data in the right format allows users with different needs to reuse it efficiently.","how":"Identify the different data scopes and match those scopes with the types of users you want to reach. For example, you might want to provide programmatic access to the database (see ‘Provide access to your data via an API’) for fellow researchers while also providing the data tables behind the visualisations for journalists. ","resources":"44,21","contacts":"62,9","examples":"31","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9C","topic":"Prepare Visuals","STATUS":"ADINA","order":"1","title":"If necessary, obtain the licences to use third-party visualisations","why":"Visualisations, like other literary, scientific, or artistic works, may be protected by intellectual property rights. If you are using visualisations that were not created by your own institution, it is important to get proper permission from the original author to use them and to figure out if the visualisations can be reused by others. ","how":"If you are not the author of the visualisation, make sure you obtain the permission to use it, and keep proof of this permission. The permission might take the form of a reuse licence. For example, CC BY 4.0 is a commonly used licence which means that you are allowed to use the visualisation with proper attribution. In the case that external contractors are producing the visualisations for you, make sure to explicitly mention the visualisations as a deliverable. This way, the ownership and licensing modes of the publication will also apply to the visualisation. All third-party visualisations must be explicitly mentioned in the publication’s copyright notice. ","resources":"1,44","contacts":"5,6","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare Visuals","STATUS":"ADINA","order":"2","title":"Licence your visualisations so that others can reuse it","why":"A licence specifies the conditions under which others can reuse and share your visualisations. To support people in using and distributing your work, decide on a reuse licence for your visualisations.","how":"Your institution’s reuse policy regulates which licences can be applied. Be sure to check your own institution's reuse policy. By default, all visualisations owned by the European Commission are licensed under CC BY 4.0. This licence allows anyone to adapt and share the visualisation, even for commercial purposes. They must, however, give appropriate credit and indicate if they have made any changes. In the case that you are using third-party visualisations, the licence under which your readers can reuse them, is defined by the original rightsholder. \n\nState the reuse licence beneath your visualisations (see recommendation ‘State the author of the visualisation, the data source and the reuse licence’) and in the metadata of the visualisations (see recommendation ‘Add metadata to your visualisation’). ","resources":"1,44","contacts":"5,6","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare Visuals","STATUS":"FORMATTING","order":"3","title":"Add metadata to your visualisation","why":"Metadata not only ensures that visualisations are cited and attributed correctly, it also makes your charts accessible to people using screen readers and increases searchability online. ","how":"The following information should always be provided in the metadata: \n-Title and subtitle \n-Description\n-Date \n-Author and source\n-Copyright Status\n-Copyright Notice\n-Keywords\n\nHow you add metadata to your visualisations depends on which formats you are using: \n-Standalone visualisation (JPEG, PNG): Images support IPTC (International Press Telecommunications Council) metadata that can be viewed, added, or modified with several tools, for example Adobe Bridge 2022.\n-Visualisations online: As metadata embedded in the standalone image files is not read out by screen readers, it is good to use HTML-tags for image metadata online. \n-Visualisations in PDF publications: In a Microsoft Word manuscript you can add metadata to your visualisations by right-clicking on the image and selecting ‘edit alt text’. This description remains if the manuscript is converted into a PDF (as opposed to descriptions for tables which are not preserved).\n","resources":"155","contacts":"166","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9A && 12A","topic":"Publish","STATUS":"SPOTLIGHT","order":"1","title":"Provide your visualisations as downloads","why":"Readers might want to reuse the visualisations in your publication. Providing a way to download the visualisations separately and in the right format will ensure that they don’t just screenshot them in a subpar quality. This should be done only if you hold all the rights on the visualisations and third-party material is properly licenced.","how":"Provide the possibility to download your visualisations. Users might want to download all the visualisations from the publication at once. So be sure to provide both a single-file download option and the option to download a zip-file containing all visualisations. If you are publishing an online publication that provides the options for users to make changes to the visualisations (e.g., the colour or the dataset shown in the chart), make it possible for them to download the visualisation as they have changed it.","resources":"","contacts":"","examples":"7,9","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Publish","STATUS":"ADINA","order":"2","title":"Provide options to share your visualisation online","why":"Sharing visualisations online are a great way for people to reuse and discuss your work. Share buttons mostly allow readers to share the visualisation on social media platforms but can also give them the option to copy a direct link to the visualisation and send it via email. ","how":"You can provide share buttons no matter if you have a full online publication with interactive charts or are simply providing a PDF publication and static visualisations to download. If you are using an online charting tool to create the visualisations, you can check if it comes with a built-in functionality to add share buttons. Apart from social media and link sharing options, consider giving users the possibility to add your charts to their own websites by providing an embed code (a snippet of HTML code which the user can copy. Only provide the sharing options that are relevant to your target audience, as to not overload the readers with possibilities.","resources":"","contacts":"","examples":"9","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"ADINA","order":"1","title":"Define the purpose of your data visualisation","why":"Data visualisations present an insight into your data. They allow readers to compare, organise, make correlations, and see relationships. Each visualisation in your publication should have a single, clearly defined purpose. It should be meaningful and easy to understand.","how":" After you have analysed your data, think about which insights you have gained from it. Then, decide on which of those insights would be interesting to your readers. For example, an insight might be that, over the years, the gender gap in cultural employment has gotten smaller across EU member states. Next, you can translate this insight into a message. Aim to create one visualisation per message you want to convey. Following our example, the message could be: ‘The gender gap in cultural employment is at an all-time low ’. Finally, be sure to check this message against your data again. \n\nIn some cases, text or other types of graphics might be more suitable than a data visualisation: If your data has caveats (e.g., a small sample size), a data visualisation might mislead your readers. Likewise, if you have qualitative information rather than quantitative data, it might be better to create an infographic or even just describe the information in a text.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A","topic":"Visualise","STATUS":"DONE","order":"2","title":"Choose the right type of visualisation","why":"Different chart types encode data in different ways, making different aspects of your data visible. For example, a stacked bar chart allows readers to compare parts to a whole while a line chart shows a development over time. Therefore, it is essential to choose the right chart type to make the message you want to communicate through your data clear and understandable. ","how":" Then choose a chart type (e.g., bar chart, line chart, scatter plot, etc.) that fits the data properties and communicates that aspect. There are various resources that list all available chart types and help you choose the right one (see ‘Resources’ below). \n\nOnce you have found a fitting chart type, consider if small design amendments might communicate the information in your data more clearly (e.g., flip the chart 90 degrees so that the lines run vertically across the page).","resources":"87,37","contacts":"","examples":"1","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"RESOURCES, FORMATTING","order":"3","title":"Follow best design practices","why":"Following certain design principles can make your data visualisations more attractive and easier to read. Many of these design principles also help make your visualisation more accessible. ","how":"Consider the following points: \nHierarchy: \n-The visualised data should be high in the visual hierarchy while supportive elements, like axes and axes labels, should retreat to the background.\n-Font sizes of text elements should reflect their importance\nTypography: \n-Font choice should take into account the visual identity.\n-Use fonts that are designed to be easily legible on a screen. Avoid cursive and fantasy fonts.\n-Use font sizes that are 12 points / pixels and larger\n-Don't rotate text, it should always stay horizontal.\n-Don’t distort fonts.\nAlignment: \n-Align visualisations to the grid of the publication\n-Align elements of a chart to each other\nColour:\n-Avoid colours and colour schemes with strong connotations\n-Choose colours so that they fit the content of your data \n-Pick harmonious colour palettes\n-Assure enough contrast between the colours (see recommendation “Choose accessible colour combinations”)\n-Negative Space: Use negative space (whitespace) to let your visualisation breath \n\nMake sure these design decisions are consistent across the publication: use the same colours to encode the same variables and use the same font sizes and layout for each chart. A section on data visualisation in your style guide and predefined templates (e.g., in Excel) can help you stay consistent throughout and across publications.\n","resources":"133,33,34,106","contacts":"30","examples":"","image":"","gallery-image":"visualisation-design-1,visualisation-design-2,visualisation-design-3","gallery-text":"Hierarchy: The visualised data should be high in the visual hierarchy while supportive elements, like axes and axes labels, should retreat to the background. | Hierarchy: Font sizes of text elements should reflect their importance | Typography: Use fonts that are designed to be easily legible on a screen"},{"condition":"3A","topic":"Visualise","STATUS":"RESOURCES, FORMATTING","order":"4","title":"Follow best data visualisation design practices","why":"When statisticians began creating and using data visualisations in the 18th century, people had to learn how to read them at first. Today, people have grown used to certain design elements that help them decipher the meaning of a chart. If you want your readers to understand your visualisations quickly and with ease you can make use of those design patterns. \n","how":"Some Do's and Don'ts: \nDon’t: \n-Don’t use 3D-charts. Use 2D-charts instead. \n-Don’t create charts with two x-Axes. Put two charts below each other instead. \n-Don’t use decoration. Declutter the design instead.  \n-Don’t overuse lines. \n-Don’t use two different x-axes. \n-Don’t use inconsistent axes. The y-axes should always start from Zero and the values should be spaced evenly along the x-axes.\n-Don’t use vertical text\n\nDo: \n-Use a standard visualisation layout: Figure number, title, subtitle, key / legend, chart body, footnote, source, author and licensing \n-Order the data in an apparent logic, for example by size or alphabetically\n-Label elements directly, if possible\n-Highlight important points through colours, shades, and annotations\n-Provide context: show missing data, uncertainty ranges, trendlines and benchmarks\n\nIn the best case, these best practices are covered in the data visualisation section of your organisation’s style guide. \n","resources":"133,33,34","contacts":"30","examples":"1","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A) && 11A","topic":"Publish","STATUS":"DONE","order":"3","title":"Provide your data as download","why":"The most interesting and well-structured data is lost, if that data cannot be found and extracted. Therefore, providing easy and clear access to the data is crucial. ","how":"Provide the possibility to download your data. As the EU data catalogue data.europa.eu does not host the data itself but provides links to the data, the data must be hosted on your organisation’s website or on an FTP (File Transfer Protocol) server. It is important to maintain those links to the data, i.e., ensure that the links are not broken if the storage structure changes. ","resources":"44","contacts":"","examples":"33","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A) && 11A","topic":"Publish","STATUS":"ADINA","order":"4","title":"Provide access to your data via an API","why":"An API (Application Programming Interface) is a set of definitions and protocols that grant information users access to the data provided by you, the information provider. With an API, information users can acquire your data in an automatic, systematic, and customised manner, often via an URL (Uniform Resource Locator). ","how":"Especially for high value datasets it makes sense to consider providing an API for advanced users to access your data more easily. When setting up your API, it is important to use correct status codes and headers, as well as paging for large amounts of data. Always provide ample documentation of the API to ensure that people can use it. ","resources":"","contacts":"","examples":"34","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"ADINA","order":"5","title":"Choose accessible colour combinations","why":"One in twelve men and one in two hundred women have some type of colour blindness. Many people also have poor eyesight or suffer from vision impairment. To make your charts more accessible on a visual level, choose accessible colour combinations (see recommendation ‘Write alt text for your visualisation’). Under EU law, public body websites and mobile apps have to be accessible to persons with disabilities, including people with visual or hearing impairments. In HTML, essential accessibility requirements are outlined in the Web Content Accessibility Guidelines (WCAG) of the World Wide Web Consortium (W3C), which defines three levels of compliance: A (represents the absolute minimum requirements for basic accessibility), AA, and AAA. Since 2010, all new websites under the EUROPA domain have to be built according to level AA.","how":"In choosing accessible colours, the keyword is ‘contrast.’ The WCAG defines contrast as a measure of the difference in perceived brightness between two colours. The colours you use should have enough contrast to the background and to one another. You can ensure this by running your visualisation through a contrast checker (see resources below). For conformance level AA, a contrast of at least 4.5:1 for normal text and 3:1 for large text and graphics is required. In addition, avoid the use of colour or contrast as the only means to convey information. Instead, add patterns and labels to ensure readability.","resources":"153,104,106,152,77,154","contacts":"79","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"DONE","order":"6","title":"Write meaningful titles for your visualisations","why":"The title of a visualisation is usually the first – and sometimes the only – element the reader will look at. A meaningful title is a title that summarises the key findings shown in the chart. This helps guide readers through the data and makes the chart self-contained and reusable.","how":"In the title, try to summarise the main message of the visualisation in less than ten words. Use the subtitle to describe the data, its geography, the time period, and the units of measurement. ","resources":"167","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"DONE","order":"7","title":"Write succinct visualisation legends","why":"Legends describe how different data variables are encoded in visual elements, thus serving as an instruction on how to read a visualisation. Legends are the key to understanding the visualisation and should therefore be created with considerable care. Legends can be separate from the visualisation (placed above, below or to the side of the visualisation) or integrated into the visualisation itself (in the form of annotations).","how":"Make sure to keep the wording in your legend consistent, succinct, and short. Defer from using abbreviations and complicated words. Finally, make sure that each visual element is explained. A good way to test if your legend works, is to show it to people outside of your field of expertise. Ask them to describe their thoughts out loud as they try to read the visualisation. \n","resources":"168","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"DONE","order":"8","title":"State the author of the visualisation, the data source and the reuse licence","why":"Nowadays, visualisations from a publication can easily be reused: They might be added to a powerpoint presentation as a screenshot or be downloaded and posted on social media platforms. Because your visualisations might reappear in different contexts, it is best to cite the author (the organisation or person that created the visualisation), the data source (the data used to create the visualisation) and the reuse licence (the conditions under which the visualisation might be reused) with each chart.\n","how":"The author, data source, and reuse licence are often placed below the visualisation, in the bottom left and right corner. Use a relatively small font size and / or a lighter colour than used in the rest of the chart. If possible, use abbreviations and underlay those abbreviations with links directly to the author, data source and licence description (see recommendation ‘Licence your data visualisations so that others can reuse it’).\n\nFor the data source you might choose to use the name of the data provider (e.g., ‘JRC’); or you might use your own reference system to refer to the data source (e.g., Eurostat uses a unique code such as ‘tag00001’ to identify each data set). \n\nFor the reuse licence, follow the guidelines applicable to images, photos and illustrations. The copyright notice of a standalone visualisation owned by the European Commission would look like this: © European Union 20XX Licensed under CC BY 4.0 (https://creativecommons.org/licenses/by/4.0/). \nHowever, if the visualisation displays content that is not fully owned by the EU (limiting reuse), these aspects should be clearly signalled. Explicitly mention if some (notably third party) visualisations cannot be reused. ","resources":"117","contacts":"","examples":"4","image":"","gallery-image":"","gallery-text":""},{"condition":"2A || 3B","topic":"Structure","STATUS":"DONE","order":"1","title":"Introduce your data in a dedicated section","why":"You might be publishing original data, or you might be using data from various sources to support your arguments. Either way, thoroughly introducing your readers to the data used in your publication fosters understanding, trust and transparency.","how":"Describe what the data covers (dimensions and units), why it was collected (policy context), how it was collected and processed (methodology), who collected it and who owns it (source), and what it can and cannot be used for (definitions and limitations). Besides describing the data in a text, you can also present the most important metadata in a table. If you are using one dataset throughout the publication, describe your data in the introductory chapter. This section should also contain a link to the main datasets or database. If you are using multiple datasets, you might introduce these throughout the publication.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A || 3B","topic":"Structure","STATUS":"DONE","order":"2","title":"Create a consistent, logical sequence of text and visualisations","why":"Publications with too much text often lack variety and publications with too many data visualisations often lack context. Balancing the amount of text and data visualisations and bringing textual and visual elements into a consistent sequence, will make your publication enjoyable and easy to read.","how":"Set a rule of thumb for how much text follows or precedes each data visualisation. For example, you could aim for always having three to four paragraphs of text between visualisations. In a print or PDF publication, try to place each visualisation as close as possible to the paragraphs that reference it. In an online publication, integrate the visualisation into the text flow: The paragraphs before the visualisation highlight the most important findings and introduce any concepts that are necessary for the reader to understand the visualisation. The paragraph after the visualisation can provide more context and summarise the most important message of the visualisation. When referencing visualisations from other parts of the publication, provide a direct link to the (page that contains that) visualisation.","resources":"","contacts":"","examples":"25,26","image":"structure-balance","gallery-image":"","gallery-text":""},{"condition":"","topic":"Structure","STATUS":"SPOTLIGHT","order":"3","title":"Provide a reference list of the data used in the publication","why":"Just as you might provide a list of the literature that is referenced in your publication, it is good practice to provide a reference list of the data that you have used in your publication. This allows others to identify and locate your data sources, to reuse the data, to reproduce results, and to cross-check your data sources against others.","how":"The format recommended by the European Commission is the following: Author(s), ‘Title,’ version, Publisher, date, date of citation, PID\n\nThe PID is a Persistent Identifier in the form of a link to the data set. The reference list should be numbered. Use a consistent referencing format throughout your publication.\nExample: Sevini, F. and Arnés-Novau, X., ‘Export control handbook for chemicals’, version 2021 edition, European Commission, Joint Research Centre (JRC), 2021, accessed 23 September 2022, http://data.europa.eu/89h/8f0d4fa2-110d-4c05-b2a8-ecd3addbf16b ","resources":"117","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Structure","STATUS":"DONE","order":"4","title":"Include data visualisations in the figure list","why":"Most likely you are already providing a list of figures. Data visualisations should be included in this list so that they can be looked up and referenced as well.","how":"The publication’s charts and maps can be entered into a simple reference list that is formatted according to your organisation’s citation guidelines. Additionally, you can also show each visualisation as a thumbnail to provide a visual reference. This is especially popular online where the publication’s charts and maps are sometimes collected on an additional page. Often, this is also where readers can download the visualisations (also see ‘Provide your visualisations as downloads’). ","resources":"","contacts":"","examples":"24,29","image":"structure-figurelist","gallery-image":"","gallery-text":""},{"condition":"","topic":"Structure","STATUS":"ADINA","order":"5","title":"In the copyright notice, state the reuse licence of the data and the data visualisations","why":"A reuse licence specifies the conditions under which others can reuse and share your data and data visualisations. To support reuse efforts (and with that the further distribution of your work), clearly communicate under which terms the data and the data visualisations can be reused. To allow for data visualisations in particular to be detached from the original publication and be reused in different contexts, it must be clear that others are allowed to use them as standalone documents. ","how":"Make sure to state the reuse licence in your publication’s copyright notice. For data owned by the Commission, the following notice shall be added: \n\n© European Union, 20XX [year of first publication]\nThe Commission's reuse policy is implemented by the Commission Decision of 12 December 2011 on the reuse of Commission documents. Any copyright and/or sui generis right on [identify dataset name] is licensed under the Creative Commons Attribution 4.0 International (CC BY 4.0) licence. Reuse is allowed provided appropriate credit is given and any changes are indicated.\n\nIf the dataset incorporates data originating from third parties, make sure that you comply with any attribution requirements. Here is an example for such an attribution:\n\nThe Australian data incorporated in this dataset is sourced from ‘1345.0 - Key Economic Indicators, Summary,’ licensed by the Australian Bureau of Statistics under Creative Commons Attribution 4.0 International\n\nFor data visualisations owned by the Commission, follow the guidelines applicable to images, photos and illustrations. Bear in mind that for visualisations to be used as standalone documents a separate copyright notice should be embedded or added beneath them (see recommendation ‘State the author of the visualisation, the data source and the reuse licence’).\n\nOther institutions, bodies and agencies must follow their own reuse policy.","resources":"3,120,7,1,44","contacts":"5,6","examples":"28","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Prepare the Data","STATUS":"FORMATTING","order":"5","title":"Describe your data with metadata","why":"Metadata describes your data with additional information, stating for example, the title, the author and the licence. These descriptions are standardised to ensure compatibility. Metadata allows machines to interpret and people to understand the characteristics and context of your data. If your data is published in a catalogue, metadata also makes it possible for others to find your data. Even if you cannot publish your data as open data, it still makes sense to describe it in a standardised way for your own documentation. ","how":"The following metadata information should be provided in order to increase the findability of data: \n-Title\n-Description\n-Keywords\n-Categories\n-Temporal information\n-Spatial information\n-Licence\n\nOften, when publishing your data in a catalogue, some metadata fields are set as mandatory, which means that they have to be filled in before the data can be published. However, it is recommended that metadata fields that are not set as mandatory also be filled in. For metadata description use DCAT-AP (the Data Catalogue Vocabulary of the EU), the Eurovoc thesaurus and EU reference data. \n","resources":"48,123,44","contacts":"62","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && !5D","topic":"Visualise","STATUS":"DONE","order":"9","title":"Show the data values","why":"Showing the data values in the visualisation allows readers to check the quality of the visualisation. This increases readability and trust in the visualisation. It also makes it possible for readers to reuse the data even if it is not available for download. ","how":"In static visualisations, the data values can be shown directly on the chart. If there is not enough space to show all data values, annotate the chart with the most important ones (e.g., minimum, maximum and most recent value). In interactive visualisations, a tool tip can be provided that shows the data values on hover. \n\nIn addition to showing the values in the visualisation, you can also show a data table. In a static publication format, the table can be shown below or next to the visualisation. In an interactive publication, you can allow the reader to switch between the chart and the table view.","resources":"","contacts":"","examples":"2,3","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"DONE","order":"10","title":"Annotate important features","why":"Annotations can guide readers towards important aspects of your data. They also provide context to the data, often explaining why certain developments, trends or changes show in the visualisation. ","how":"Identify salient features in your data visualisation: Is there a surprising development? Are there certain points that stand in contrast to the overall statement of the chart? Which features explicitly support the chart’s overall statement? Write short sentences or clauses to explain these features. Use arrows or lines to connect the feature with the annotation.","resources":"168","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"ADINA","order":"11","title":"Make use of official EU geodata for maps","why":"The mapping of areas, especially disputed areas, in an official context is an extremely sensitive issue. Carelessly plotted, designed, or labelled maps can cause far-reaching diplomatic incidents. The GISCO (Geographic Information System of the European Commission) team at Eurostat, together with DG COMM and the External Action Service of the EU, are responsible for correctly showing the official position of the EU on territorial conflicts. ","how":"When making maps for your publications make use of GISCO’s resources. The GISCO team creates statistical and other thematic maps, manages a database of geographical information, and provides related services to the European Commission. The GISCO tools can be used by all EU institutions, as well as external contractors. A login might be required. \n","resources":"134","contacts":"135","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 5D","topic":"Visualise","STATUS":"FORMATTING","order":"12","title":"Decide which interactive functionalities to offer","why":"Many online charting tools come with integrated interactive functionalities and animations. These should not distract from the main message of the chart. Instead, they should offer the reader more information on demand and help them explore the visualisation. ","how":"If you are publishing an online publication, make a conscious decision on which interactive chart functionalities you want to offer. They can include: \n-Animations: Animations should only be used if they support the interpretation of the visualisation (e.g., help readers see a development over time) or directly encode aspects of the data (e.g., fast animations to encode a rapid development reflected in the data).\n-Tooltip that shows underlying values: Tooltips help readers go into details and read the values without having to download the data. If you are using built-in tooltips, check if they are mobile-friendly. \n-Show, hide and highlight aspects of the data: This allows readers to set their own focus in the chart and is especially helpful for people who work with the information in your publication. \n-Control what data to show: These features range from a simple date filter to options to change the data source. More advanced features like the later, are usually more suited to a dashboard than to a linear publication with text and visualisations. \n-Change how the data is shown: These features allow users to change the chart type and chart design. Providing such options usually makes more sense when you are providing the data in a dashboard.\n","resources":"","contacts":"","examples":"3","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"DONE","order":"13","title":"Make sure your interactive charts are accessible with the keyboard","why":"Not everyone can use a mouse to access content online. Therefore, it is important to ensure that charts can be navigated with the keys alone (e.g., with the ‘Shift’ and ‘Enter’ keys). ","how":"Most interactive charting tools such as Highcharts come with integrated keyboard navigation support. If you are using your own tools or implementing a new charting library, make sure to check and, if necessary, implement these features.","resources":"169","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Write","STATUS":"RESOURCES & FORMATTING","order":"1","title":"Use various writing techniques to make text about data more comprehensible","why":"Reading a text full of numbers can be exhausting. It is also hard to imagine larger numbers and what they stand for. There are different ways to write about numbers that help readers get a better grasp of what they mean. ","how":"Some good guidelines include: \n- Use rates, ratios, proportions, and fractions (e.g., “EUR 5 000 per person” or “1 in 7 EU citizens”)\n- Normalise your data so that readers don’t have to do maths\n- Ditch the decimals; use only whole numbers in your text\n- Use numbers for the main messages in your text and generalise the rest (e.g., “roughly,” “around,” “half of”)\n- Provide human scale as a comparison (e.g., football fields, coffee cups, etc.)\n","resources":"163,127","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Write","STATUS":"FORMATTING","order":"2","title":"Make sure that the text complements the data visualisation","why":"When your body text says one thing and your visualisation shows another, your readers are likely to be confused. Therefore, a text that references or describes a data visualisation must complement what can be seen in that visualisation. (For recommendations on text within the visualisation (e.g., the title and the legend), see the recommendations under ‘Creating data visualisations’, for alt text see the recommendation ‘Write alt text for your visualisation’).","how":"Text and visualisation play different roles when presenting data: Text provides context to the data and highlights important findings. Data visualisations allow readers to visually compare variables and discover trends and developments. In the paragraphs that preempt or follow a data visualisation pay attention to the following caveats: \n-In the text, make sure to introduce all necessary concepts for people to understand the visualisation\n-Make sure that the trends or overall developments described in the text match what the visualisation shows. \n-In the text, use the same units of measurement as in the visualisation. You can always mention other kinds of units additionally. \n-Avoid contextual temporal adjectives (e.g., ‘last year,’ ‘next month’). Instead, use exact dates, years or time periods.\n","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare Visuals","STATUS":"DONE","order":"4","title":"Write alt text for your visualisation","why":"An important type of metadata is alternative text, also known as ‘alt text’. Alt text is a written description of the visualisation. If a reader is using a computer or a website in accessibility mode, this description will be read out by the screen reader. This allows visually impaired users to access the data visualisation through an oral representation of it.","how":"In static data visualisations the alt text corresponds to the ‘description’ field in the metadata. Online, alt text is added through the <alt> HTML tag. Charting tools often provide the option to add alt-text without the need to write any code yourself. Social media platforms, such as Twitter and Instagram, also allow users to add alt text to their images before posting them. \n\nAn easy formula to write alt text goes as follows: [Chart type] of [type of data] where [reason for including the chart]. An example would be: ‘Line chart of the number of hectares burnt in Europe over the year in 2020, 2021 and 2022 where 2022 clearly has the highest rates even though the year is not over yet.’ ","resources":"157,156,77","contacts":"79","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare Visuals","STATUS":"DONE","order":"5","title":"Export visualisations separately from the publication","why":"People who read your publication might want to reuse your visualisations in their own publications and in presentations or share them on social media. Therefore, it makes sense to provide them as separate files, in addition to the main publication.","how":"If you want to provide a closed format that users cannot change by themselves, export the visualisation as a PNG (the ‘Portable Network Graphics’ format). If you want to allow the users to edit the style of the visualisation you can additionally provide a vector-based format such as an SVG (Scalable Vector Graphics). Consider offering multiple aspect ratios, such as a 16:9 ratio for presentations and a 1:1 ratio for social media. Be sure that the exported visualisations contain metadata (see ‘Add metadata to your visualisation’).","resources":"","contacts":"166","examples":"7","image":"","gallery-image":"","gallery-text":""},{"condition":"6A && (7A || 8A)","topic":"Publish","STATUS":"DONE","order":"5","title":"Publish your data in a data catalogue","why":"A data catalogue is an inventory for data. It is essentially a collection of metadata records which describe datasets. By providing tools to search this metadata, the catalogue allows users to find and access the data they need. Data catalogues such as data.europa.eu do not host the data but link to the location where the data can be accessed. ","how":"If your data is open data, you can catalogue it on data.europa.eu. To do so, make a request for data identifiers in DemPub. This is possible regardless of whether you are publishing the publication with the OP or not. Once the request is processed you will get a unique identifier for your data and the data will be included in the data.europa.eu catalogue. Even if data cannot be released as open data, reach out to your Local Data Correspondent about publishing it on the internal EC data catalogue (for European Commission services) or on your institution's internal data catalogue (for other Institutions, agencies and bodies).","resources":"84,13,165","contacts":"80,62,13,","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Write","STATUS":"FORMATTING","order":"3","title":"For visualisations that are frequently updated, write generic text","why":"Writing text about data visualisations that are frequently updated with new data is a challenge. However, there are methods that minimise the amount of text that must be completely rewritten every time the data is updated. ","how":"Either one of following concepts can be used when writing about updating visualisations, in order from more to less work per update: \n-You can outline trends and developments and update only those specific descriptions. \n-You can state only the values without describing any trends. Those numbers can be updated manually or be programmed to update automatically.\n-You can abstain from naming trends or specific values and simply introduce the data and the methodology used to create it. \n\nIf the data is updated frequently, you might consider creating two separate products: A dashboard that shows previous versions and new updates for people to explore the data; and publications that focus on a particular update and lead the reader through the most interesting findings of that update. \n","resources":"","contacts":"","examples":"30","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Write","STATUS":"FORMATTING","order":"4","title":"Write for the web","why":"Whether you are producing a PDF (Portable Document Format) or a web-based publication, chances are your content will be read online on devices ranging from large desktop computers to small mobile phones. If you write with an online publication in mind, you can ensure a more pleasant reading experience across devices. In addition, a well-defined text layout will make your content machine-readable and accessible, as online search-engines and assistive technologies make use of these definitions.","how":"Some guidelines for web-friendly text include:\n-Define clear title hierarchies (3 max.). Consistently use the same font sizes and font styles for each hierarchy. To designate those styles, use HTML-tags online and headings style in Microsoft Word.\n-Write in sentences that are concise and are no longer than 25 words.\n-Break up your content into short paragraphs of about 1 to 4 sentences. Make sure that the width of these paragraphs in the publication layout is not more than 75 and not less than 45 characters. \n-Use hyperlinks to point to further information and original research or data.\n-Use the \"inverted pyramid\" structure for your texts: start with the  essential information, then expand on and supplement this information with details and finally add non-crucial background information. ","resources":"151,138,140,144,94,95,93,132,88,160","contacts":"79","examples":"27,35","image":"text-web","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Prepare the Data","STATUS":"FORMATTING","order":"6","title":"Structure your data in a machine-readable format","why":"Open data is often read and processed with the help of computer programmes. Therefore, it is important to structure the data in a way that makes it easy for a computer to understand – in a logical, consistent way. ","how":"In structuring your data (i.e., your spreadsheet), there are some simple rules you can follow to make it machine-readable. In the case that you are working with external contractors, make sure to ask the contractor to prepare the data in line with the recommendations we give here. \nDo’s\n-Give each column a short descriptive heading.\n-Use a single header row.\n-Ensure you have used the first cell, i.e. A1. \n-Avoid white space and additional information in the file.\n-Ensure that all rows have the same number of columns.\n-Indicate units in an easily processable way.\n-Mark null values explicitly as such.\n-Encode date and time as ISO 8601 (YYYY-MM-DD hh:mm:ss). If applicable, the time zone used should be stated (derived from UTC – Coordinated Universal Time). \n-Formatting of decimal numbers and numbers in the thousands\n-Make use of standardised character encoding\n-Use URIs (Uniform Resource Identifiers) to identify entities\n\nDon’ts \n-Don’t use thousand separators such as white spaces and dots.\n-Don’t embed charts, comments, or tables within a spreadsheet.\n-Don’t use colour coding (machine-based data mining cannot interpret this).\n-Don’t include special (i.e., non-alphanumeric) characters within the spreadsheet, including commas.\n-Don’t use merged cells.\n","resources":"44,131,53,56","contacts":"62","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Prepare the Data","STATUS":"DONE","order":"7","title":"Create documentation about your data","why":"Basic metadata makes your data findable and machine-readable; documentation makes it human-readable. To support people reusing and working with your data, provide documentation. ","how":"The documentation should include everything that users need to to fully understand the data, such as methodology, time ranges, sample sizes, definitions, descriptions of the variables and the acronyms used in the dataset, and limitations. The documentation can be provided in a separate file or published on the landing page from which the data can be accessed (e.g., on the data portal). ","resources":"44","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Prepare the Data","STATUS":"DONE","order":"8","title":"Save your data in a machine-readable file format","why":"People who reuse your data might use various kinds of computer software or programming languages to do so. Therefore, it is important to provide file formats that can be read and processed, regardless of the specific software being used. These text-based file formats are often smaller and can therefore also be downloaded and handled more easily. ","how":"Save your data in a non-proprietary file format, such as CSV (Comma Separated Values) or JSON. You can always provide software-specific formats, such as Excel, additionally for less technical users. When saving your data, deposit each table that is part of the dataset as a separate file. Give the file a name that appropriately reflects its content. When you are using the CSV (Comma Separated Values) format, make sure to use commas as the delimiter (see recommendation ‘Structure your data in a machine-readable format’). If you are working with a contractor, make sure to explicitly mention data as a deliverable. Ask the contractor to prepare the data in line with the recommendations we give here.","resources":"44","contacts":"62","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 5D","topic":"Visualise","STATUS":"DONE","order":"14","title":"Create visualisation designs for different screen sizes","why":"Increasingly, content is consumed on smaller screens, i.e., mobile devices. This means that online content needs to responsively adjust to the screen size the reader is using. Data visualisations are no exception: They need to be designed in a way that layout and font-sizes responsively adjust to the width of the screen. ","how":"Often interactive charting tools such as Highcharts come with built-in functionalities for responsive design. If not, check with your developers and designers for which screen sizes you are optimising. In terms of static charts, designers might create multiple versions for different platforms (e.g., one for the PDF-Publication and one for social media platforms).","resources":"","contacts":"","examples":"","image":"visualisation-screensizes","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualise","STATUS":"DONE","order":"15","title":"Keep future translations in mind","why":"In contrast to many other international bodies, the European Union is a multilingual organisation. All official languages of member states are also official EU languages. For one, this is to ensure that the general public and national courts can read and understand any applicable EU laws. For another, translated documents ensure democratic discussion and transparency. ","how":"When creating a visualisation for a multilingual publication, keep in mind that titles, keys, labels, and annotations must all be translated. It is therefore important to keep any text in the visualisation short and succinct. When providing the publication to the translation service, ensure that you provide enough context to avoid that those short texts are mistranslated.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Write","STATUS":"RESOURCES & FORMATTING","order":"5","title":"Write in plain language","why":"Plain language is simple, concise and well-organised writing that is appropriate for your intended audience. For a variety of reasons, many people struggle to read complex texts. Also, especially online, readers mostly do not study unnecessarily complicated texts. Plain language makes your content accessible and easy to consume. ","how":"Some good guidelines include:\n-Know your audience and know which terms your audience understands;\n-Use simple terms and explain them either on their first occurrence or in a glossary;\n-Avoid jargon, synonyms and abbreviations;\n-Avoid overcrowding the text with acronyms and abbreviations; spell them out on their first occurrence or add a list of abbreviations to your publication;\n-Write in short sentences (20 – 25 words max.) and paragraphs (1 – 4 sentences max.).\n","resources":"148,88,89,125,126","contacts":"159","examples":"27","image":"","gallery-image":"","gallery-text":""}]