[{"condition":"","topic":"Structure","title old":"Structure the content consistently","title":"Use a consistent text hierarchy","why":"Structuring your publication in a logical, consistent way makes it machine-readable. Search machines can index it more easily and it might be used for research and machine learning algorithms. Clearly defined text hierarchies also make a publication more accessible, as screen readers and assistive technologies make use of these definitions.","how":"Decide which title hierarchies contain content and which – if any – serves as structuring elements. Consistently use the same font sizes and font styles (and, in the case of online publications, HTML-Tags) for the different text hierarchies.","resources":"85,111","contacts":"81","examples":"","image":"structure-hierarchy","gallery-image":"","gallery-text":""},{"condition":"","topic":"Structure","title old":"Provide visualisations that help the reader orient themselves in the publication","title":"","why":"Such a visualisation – usually in the form of a diagram – shows the main chapters or topics of the publication and how they relate to one another.","how":"A further diagram can be used to provide an overview over other, related publications.","resources":"","contacts":"","examples":"22","image":"","gallery-image":"","gallery-text":""},{"condition":"2A || 3B","topic":"Structure","title old":"Provide a section that introduces the data used in the publication","title":"Provide a section that introduces your data","why":"You might be publishing original data, or you might be using data from various sources to support your arguments. Either way, thoroughly introducing your readers to the data in your publication fosters understanding, trust and transparency.","how":"Describe what the data covers (dimensions and units), why it was collected (policy context), how it was collected and processed (methodology), and what it can and cannot be used for (definitions and limitations). Besides describing the data in a text, you can also present the most important meta data in a table. This section should also contain a link to the main datasets or database.","resources":"","contacts":"","examples":"18","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Structure","title old":"Provide a reference list, a figure and a table list, a list of abbreviations, and a glossary","title":"Provide a reference list of the data used in the publication","why":"Just as you might provide a list of the literature that is referenced in your publication, it is good practice to provide a reference list of the data that you have used in your publication.","how":"The format recommended by the European Commission is the following: author(s), ‘title’, version, publisher, date, date of citation, PID\nThe PID is a Persistent Identifier in the form of a link to the data set. The reference list should be numbered. ","resources":"","contacts":"","examples":"24,29","image":"","gallery-image":"","gallery-text":""},{"condition":"3A || 3B","topic":"Structure","title old":"Use text and visual elements in a way that enables a good reading flow","title":"Balance text and visualisations","why":"Publications with too much text often lack variety and publications with too many data visualisations often lack context. Balancing  the amount of text and data visualisations and bringing textual and visual elements into a consistent sequence, will make your publication enjoyable and easy to read.","how":"Set a rule of thumb at the beginning of your production process. For example, you could aim for always introducing a visualisation in three paragraphs, then showing the visualisation and finally summarising it in one paragraph.","resources":"","contacts":"","examples":"25,26","image":"structure-balance","gallery-image":"","gallery-text":""},{"condition":"","topic":"Structure","title old":"","title":"Include data visualisations in the figure list","why":"Most likely you are already providing a list of figures. Data visualisations should be included in this list so that they can be looked up and referenced as well. ","how":"The publication’s charts and maps can be entered into a simple reference list that is formatted according to your organisation’s citation guidelines. Additionally, you can also show each visualisation as a thumbnail to provide a visual reference. This is especially popular online where the publication’s charts and maps are sometimes collected on an additional page. Often, this is also where readers can download the visualisations (see “Provide your visualisations as downloads”). ","resources":"","contacts":"","examples":"","image":"structure-figurelist","gallery-image":"","gallery-text":""},{"condition":"16B","topic":"Design and Style","title old":"Consider creating a style guide specific to your organization","title":"","why":"The Interinstitutional Style Guide is very broad and is focused mostly on publication structure and on writing rules. An organisation style guide can refine some of the general guidelines and specifiy additional rules for the visual style and tone of voice used in your communcations. ","how":"","resources":"102,103,96,101","contacts":"","examples":"10,11","image":"","gallery-image":"","gallery-text":""},{"condition":"16C","topic":"Design and Style","title old":"Find out if your institution has it's own style guide","title":"","why":"Talk with your communications officer to find out if and what kind of style guide your organisation has. ","how":"","resources":"102,103,96,101","contacts":"","examples":"10,11","image":"","gallery-image":"","gallery-text":""},{"condition":"16A && !17A","topic":"Design and Style","title old":"Consider extending your style guide with a section on visual styles","title":"","why":"A section on visual styles defines the visual appearance of all your communciation material. This includes fonts (also font weights and sizes) and colors. It can also include publication layouts, the style of user interface elements, and guidelines on how to use the logo. ","how":"","resources":"102,103","contacts":"","examples":"10,11","image":"","gallery-image":"","gallery-text":""},{"condition":"16A && !17B","topic":"Design and Style","title old":"Consider extending your style guide with a section on data visualization design ","title":"","why":"A section on visualisation style defines font sizes and color palettes for data visualisation. Color palettes for data visualisation are different from normal brand colors in that they include color ramps, a set of categorical colors and multiples shades of each color for highlights. The guide can also define the design of visualisation details like the weight of the lines used in charts or the style of the chart axes. ","how":"","resources":"101,106","contacts":"","examples":"15,16,18","image":"","gallery-image":"","gallery-text":""},{"condition":"16A && !17C","topic":"Design and Style","title old":"Consider extending your style guide with a section on content design","title":"","why":"A section on content design defines different types of texts used in your organisation, the tone in which you address the reader, the way you handle abbreviations, and your vocabularies.","how":"","resources":"96","contacts":"","examples":"12,13,14","image":"","gallery-image":"","gallery-text":""},{"condition":"16A && !17D","topic":"Design and Style","title old":"Consider extending your style guide with a section on data citation","title":"","why":"A section on data citation defines how you want people who use your data (both in your organisation and outside of it) to reference your data. ","how":"","resources":"117","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"16A","topic":"Design and Style","title old":"Make sure your visual style guides consider accessibility","title":"","why":"In particular, check if you are using reasonably large font sizes (a minimum of around 16px for online and 12pt for print for body text, depending on the font) and if your font colors have a high contrast to the background. ","how":"","resources":"88,105","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"16A","topic":"Design and Style","title old":"Make sure your data visualisation guides consider accessibility","title":"","why":"Accessible data visualizations don't rely on color alone to encode information, provide alternative text that describes the visualisation, and label and annoate the visualisation directly. They also uses colors that have enough contrast to the background, are clearly distinguishable from each other, and account for different types of color blindness.  ","how":"","resources":"98,99,100,104,77","contacts":"79","examples":"17,19","image":"","gallery-image":"","gallery-text":""},{"condition":"16A","topic":"Design and Style","title old":"Make sure your guides on content design consider accessbility","title":"","why":"Writing guidelines that consider accessibility include guidance on using simple, concise language, using headings to convey meaning and structure, making link text meaningful, and on writing text alternatives and captions for mulimedia content.","how":"","resources":"97,121","contacts":"","examples":"20","image":"","gallery-image":"","gallery-text":""},{"condition":"16A","topic":"Design and Style","title old":"Make sure your style guide includes guidelines on data citation","title":"","why":"Check if you give examples on how you want data to be referenced in your organisation. ","how":"","resources":"117","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Text","title old":"Write for the web","title":"Write for the web","why":"Whether you are producing a PDF or a web-based publication, chances are your content will be read online on a range of devices, from large desktop screens to small mobile screens. If you write with an online publication in mind, you can ensure a more pleasant reading experience.","how":"Some good guidelines include:\n-Use clear title hierarchies;\n-write in sentences that are short and concise;\n-break up your content into short paragraphs of about 3-5 sentences;\n-use hyperlinks to point to further information and original research or data;\n-use the \"inverted pyramid\" structure for your texts: start with the most important information, then expand on and supplement this information with details and finally add non-crucial background information. You can end the text with a call-to-action.\n\nIt is also important to use design to support the legibility and reader-friendliness:\n-Use fonts and font sizes that are easily legible on screens (see “Choose accessible colour combinations and fonts”);\n-consistently use different font sizes to support title hierarchies;\n-choose the width of your paragraphs so that each text line does not contain more than 75 and not less than 45 characters.\n","resources":"93,94,95,107,132,88","contacts":"","examples":"27","image":"text-web","gallery-image":"","gallery-text":""},{"condition":"","topic":"Text","title old":"Write in plain language ","title":"Write in plain language","why":"Plain language makes your content accessible to a broad audience. For a variety of reasons, many people struggle to read more complex text. Also, especially online, readers don’t have the patience and time to consume unnecessarily complicated content.","how":"Some good guidelines include:\n-Know your audience and know which terms your audience understands;\n-Use simple terms\n-Write in short sentences and paragraphs\n-aim for a 10th to 12th grade reading level;\n-avoid jargon and abbreviations.\n","resources":"88,89,125,126","contacts":"","examples":"27","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Text","title old":"Avoid repetition","title":"Make sure that text and data visualisation supplement each other","why":"Information can be derived from both visualisations and text. Therefore, if you show data visually, there is no need to describe every aspect of it in detail in the text. As a rule of thumb, text provides a larger context while visualisations allow the readers  to compare and contrast values and categories. ","how":"In the body text, introduce readers to the data, describe trends and developments, and highlight important findings. Use annotations in the visualisation to explain important aspects of the data. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Text","title old":"","title":"Make use of different techniques to write about numbers","why":"Reading a text full of numbers can be exhausting. It is also hard to imagine larger numbers and what they stand for. There are different ways to write about numbers that help readers get a better grasp of what they mean. ","how":"Some good guidelines include:\n-Use rates, ratios, proportions and fractions (e.g., “5000€ per person” or “1 in 7 EU citizens”)\n-Normalise your data so that readers don’t have to do maths\n-Ditch the decimals; use only whole numbers in your text\n-Use numbers for the main messages in your text and generalise the rest (e.g. “roughly”, “around”, “half of”)\n-Provide human scale as a comparison (e.g. football fields, coffee cups, etc.)","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Text","title old":"","title":"Make sure that text and data visualisations match","why":"Text which describes data must match what can be seen in the data visualisation. This is true for text within the visualisation (e.g, the title. See “Write meaningful titles for your visualisation”) and for body text around the visualisation.","how":"When writing for data visualisations be aware of the following caveats:\n-Make sure that you are writing about the exact same data set as the one used in the data visualisation.\n-Make sure that the units of measurement are the same: If you show percentages, write about percentages. You can always mention absolute numbers additionally.\n-Make sure that the trends or overall developments described in the text match what can be seen in the visualisation.\n\nIn an online publication in which the data – and with it the visualisation – is going to be updated, the text must be dynamic as well. There are multiple options to minimise the amount of  text that has to be completely rewritten every time the data is updated:\n-Write the text in a generic way; without numbers and without descriptions of trends or developments. Simply introduce the topic of the data and describe the methodology used to create the data set.\n-Outline trends and developments and just update those descriptions.\n-State only the values without describing any trends. Those numbers can be updated manually or be programmed to update automatically.\n\nIf the data is updated frequently, you might consider creating two separate products: A dashboard for people to explore all the data; and a publication that focuses on a particular update and leads the reader through the most interesting findings. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title old":"Follow open data practices in preparing your data","title":"Structure and export your data in a machine-readable format","why":" Open data is often read and processed with the help of computer programmes. Therefore, it is important to structure the data in a way that makes it easy for a computer to understand – in a logical, consistent way. ","how":"It is best to provide your data in CSV- or JSON- file format. In structuring your data (i.e. your spreadsheet), there are some simple rules you can follow to make it machine-readable.\nDo’s\n-Give each column a short descriptive heading.\n-Use a single header row.\n-Ensure you have used the first cell, i.e. A1.\n-Avoid white space and additional information in the file.\n-Ensure that all rows have the same number of columns.\n-Indicate units in an easily processable way.\n-Mark null values explicitly as such.\n-Encode date and time as ISO 8601 (YYYY-MM-DD hh:mm:ss). If applicable, the time zone used should be stated (derived from UTC – Coordinated Universal Time).\n-Formatting of decimal numbers and numbers in the thousands\n-Make use of standardised character encoding\n-Use URIs to identify entities\n\nDon’ts\n-Don’t use thousand separators such as white spaces and dots.\n-Don’t embed charts, comments or tables within a spreadsheet.\n-Don’t use colour coding (machine-based data mining cannot interpret this).\n-Don’t include special (i.e. non alphanumeric) characters within the spreadsheet, including commas.\n-Don’t use merged cells.\n","resources":"53,56,57,58, 52,55","contacts":"62","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7B || 8B)","topic":"Data","title old":"Check if any licences would apply to your data","title":"If necessary, clear the licensing rights of the data","why":"Data, like visualisations and text, is intellectual property. It is therefore important to check the licensing rights to the data. If you are not producing the data yourself, you must ensure that you can use the data for your publication and figure out if and under which conditions the data can be reused. ","how":"By default, all data produced by the European Commission is licensed under CC BY 4.0. This licence allows anyone to \"copy, modify and distribute data in any format for any purpose, including commercial use. Users are only obligated to give appropriate credit (attribution) and indicate if they have made any changes, including translations.\" (Worldbank, 2020). If you want to be more restrictive about how the data is reused, you can also choose another licence (see resources).\n\nIf you are working with a contractor, make sure you list the raw data underlying the publication under the results in your service contract. This way, the ownership and licensing modes of the publication will also apply to the data. If the data is not created or commissioned by the EU, the reuse licence might be different and must be cleared with the original creator.\n","resources":"3,1,120","contacts":"5,6","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title old":"Use the right license for your data","title":"State the reuse licence of the data","why":"A data licence specifies the conditions under which others can reuse and share your data. To support reuse efforts (and with that the further distribution of your work), clearly communicate under which terms the data can be reused.","how":"Make sure to clearly state the data licence in your publication, for example on the copyright page and in the data introduction section. The following notice can be added as part of a dataset description.\n\n© European Union, 20XX [year of first publication]\nThe Commission's reuse policy is implemented by the Commission Decision of 12 December 2011 on the reuse of Commission documents. Any copyright and/or sui generis right on [identify dataset name] is licensed under the Creative Commons Attribution 4.0 International (CC BY 4.0) licence. Reuse is allowed provided appropriate credit is given and any changes are indicated.\n\nIf the dataset incorporates data originating from third parties, please make sure that this is not subject to licences that prevent its reuse and that you comply with any attribution requirements. Here is an example:\n\nThe Australian data incorporated in this dataset is sourced from ‘1345.0 - Key Economic Indicators, Summary’, licensed by the Australian Bureau of Statistics under Creative Commons Attribution 4.0 International\n\nThe Gross Domestic Product data in this dataset is sourced from OECD (2019), Gross domestic product (GDP) (indicator). doi: 10.1787/dc2f7aec-en (Accessed on 29 May 2019)\n\nEven if you don't publish your data on an open data catalogue such as data.europa.eu but on an internal one (e.g., EC Data Catalogue), it still makes sense to licence it accordingly so that other people know what they can do with it.\n","resources":"3,1,120","contacts":"5,6","examples":"28","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title old":"Describe your data in a standardized way","title":"Describe your data with metadata","why":"Metadata describes your data with additional information, stating for example, the title, the  author and the licence. These descriptions are standardised to ensure compatibility. Metadata allows machines to interpret and people to to understand the characteristics and context of your data. If your data is published in a catalogue, metadata also makes it possible for others to find your data. Even if you can't publish your data as open data, it still makes sense to describe it in a standardised way for your own documentation. ","how":"The following metadata information should be provided in order to increase the findability of data: Title, description, keywords, categories, temporal information, spatial information, licence.\nOften, when publishing your data in a catalogue, some metadata fields are set as mandatory, which means that they have to be filled in before the data can be published. However, it is recommended that metadata fields that are not set as mandatory also be filled in. For metadata description use DCAT-AP (the Data Catalogue Vocabulary of the EU), the Eurovoc thesaurus and EU reference data. ","resources":"47,68,48,123,67","contacts":"62","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7B || 8B)","topic":"Data","title old":"Describe your data in a standardized way","title":"","why":"Even if you can't fully publish your data as open data, it still makes sense to describe it in a standardized way for your own documentation. For metadata description use DCAT-AP (the Data Catalog Vocabulary of the EU), the Eurovoc thesaurus and EU reference data. ","how":"","resources":"47,68,48,123,67","contacts":"62","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A)","topic":"Data","title old":"Make sure that you provide enough documentation to your data","title":"Create documentation about your data","why":"Basic metadata makes your data findable and machine-readable; documentation makes it human-readable. To support people reusing and working with your data, provide documentation.","how":"The documentation should include everything that users need to to fully understand the data, such as methodology, time ranges, sample sizes, definitions, descriptions of the variables and the acronyms used in the dataset, and limitations. The documentation can be provided in a separate file or published on the landing page from which the data can be accessed (e.g. on the data portal). ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7C || 8C)","topic":"Data","title old":"Find out if you can provide your data as open data","title":"","why":"Follow Commission Decision of 12 December 2011 on the reuse of Commission documents  2011/833/EU","how":"Check data protection (GDPR/EUDPR) and licencing. In case of doubts contact your respective Local Data Correspondent ","resources":"","contacts":"27,5,62,13","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Data","title old":"","title":"Decide on the scope of your open data","why":"Data scope refers to the level of aggregation and wrangling the data has gone through. For example, you might have a large database of original study data, single data sets that analyse specific topics, and highly aggregated data tables that are used to create the visualisations.  Providing your data in the right data scopes allows different types of users to reuse your data efficiently.","how":"Identify the different data scopes and match those scopes with the types of users you want to reach. For example, you might want to provide programmatic access to the database (see “Provide access to your data via an API”) for fellow researchers while also providing the data tables behind the visualisations for journalists. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Data","title old":"","title":"Save your data in a machine-readable file format","why":"People who reuse your data might use various different kinds of computer software or programming languages to do so. Therefore, it is important to provide file formats that can be read and processed, regardless of the specific software being used. These text-based file formats are often smaller and can therefore also be downloaded and handled more easily. ","how":"Save your data in a non-proprietary file format, such as CSV or JSON. You can always provide software-specific formats, such as Excel, additionally for less technical users. When saving your data, deposit each table that is part of the dataset as a separate file. Give the file a name that appropriately reflects its content. When you are using the CSV format, make sure to use commas as the delimiter.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A) && 11A","topic":"Publishing","title old":"Provide access to the data (for humans and machines)","title":"Provide your data as downloads","why":"The most interesting and well-structured data is lost, if that data cannot be found and extracted. Therefore, providing easy and clear access to the data is crucial. ","how":"Provide the possibility to download your data. As the EU data catalogue data.europa.eu doesn’t host the data itself but provides links to the data, the data must be hosted on your organisation’s website or on an FTP server. It is important to maintain those links to the data, i.e. ensure that the links are not broken if the storage structure changes. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A) && 11A","topic":"Publishing","title old":"Consider providing an API (Application Programming Interface) to the data","title":"Provide access to your data via an API","why":"An API – an Application Programming Interface – is a . It allows for automatic, systematic and customised acquisition of data via an URL.  ","how":"Especially for high value datasets it makes sense to consider providing an API for advanced users to access your data more easily. When setting up your API, it is important to use correct status codes and headers, as well as paging for large amounts of data. Always provide ample documentation of the API to ensure that people can actually use it.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A) && 11B","topic":"File Management","title old":"Find out where you can store your data ","title":"","why":"Consider solutions available in your service or DIGIT. In case of doubt consult your Local Data Correspondent","how":"Consider the whole life-cycle of data including archiving policy of your DG and long time preservation ","resources":"53,13,9","contacts":"62,18","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"(3A || 2A) && (7A || 8A) && 11C","topic":"File Management","title old":"Learn about your institution's data management strategy","title":"","why":"Talk with your data governance or IT-department to find out how data might be managed in your organisation, i.e. where data is stored and how it is stored. ","how":"","resources":"","contacts":"13","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Define the aim of your data visualisation","why":"Each data visualisations present an insight into your data. They allow readers to compare, organise, make correlations and see relationships.","how":"Define what purpose each data visualisation has. For this it is important to know your data’s  characteristics. For example, you might have a list of countries and the value of their exports in 2022. With this kind of data your aim would be to compare the different countries. However, your data might also contain export values for multiple years, as well as a list of trade partners for each country. Now you must decide if the purpose of the visualisation is to allow readers to compare countries, compare countries over time or show the relationships between the countries.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A","topic":"Visualisation","title old":"Choose the right type of visualisation","title":"Choose the right type of visualisation","why":"Different chart types encode data in different ways, making different aspects of your data visible. For example, a stacked bar chart allows readers to compare parts to a whole while a line chart shows a development over time. Therefore, it is essential to choose the right chart type to make the message you want to communicate through your data clear and understandable. ","how":"Then choose a chart type (e.g., bar chart, line chart, scatter plot, etc.) that fits the data properties and communicates that aspect. There are various resources that list all available chart types and help you choose the right one (see “Resources” below).\n\nOnce you have found a fitting chart  type, consider if small design amendments might communicate the information in your data more clearly (e.g. flip the chart 90 degrees so that the lines run vertically across the page).\n","resources":"87,37","contacts":"","examples":"1","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Follow best design practices","why":"Following certain design principles can make your data visualisations more attractive and easier to read.\n","how":"Make sure these design decisions are consistent across the publication: use the same colours to encode the same variables and use the same font sizes and layout for each chart. A section on data visualisation in your style guide and predefined templates (e.g., in Excel) can help you stay consistent throughout and across publications (see XX). Consider the following points:\n","resources":"","contacts":"","examples":"","image":"","gallery-image":"visualisation-design-1,visualisation-design-2,visualisation-design-3","gallery-text":"Hierarchy: The visualised data should be high in the visual hierarchy while supportive elements, like axes and axes labels, should retreat to the background. | Hierarchy: Font sizes of text elements should reflect their importance | Typography: Use fonts that are designed to be easily legible on a screen"},{"condition":"3A","topic":"Visualisation","title old":"Follow best data visualisation practices","title":"Follow best data visualisation design practices","why":"When statisticians began creating and using data visualisations in the 18th century, people had to learn how to read them at first. Today,  people have grown used to certain design elements that help them decipher the meaning of a chart. If you want your readers to understand your visualisations quickly and with ease you can make use of those design patterns.","how":"Some Do's and Don'ts:\nDon’t:\n-Don’t use 3D-charts. Use 2D-charts instead.\n-Don’t create charts with two x-Axes. Put two charts below each other instead.\n-Don’t use decoration. Declutter the design instead.\n-Don’t overuse lines.\n-Don’t use two different x-axes.\n-Don’t use inconsistent axes. The y-axes should always start from Zero and the values should be spaced evenly along the x-axes.\n-Don’t use vertical text\n\nDo:\n-Use a standard visualisation layout: Figure number, title, subtitle, key / legend, chart body, footnote, source, author and licensing\n-Order the data in an apparent logic, for example by size or alphabetically\n-Label elements directly, if possible\n-Highlight important points through colours, shades, and annotations\n-Provide context: show missing data, uncertainty ranges, trendlines and benchmarks\n\nIn the best case, these best practices are covered in the data visualisation section of your organisation’s style guide.\n","resources":"33,30,55","contacts":"","examples":"1","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && !5D","topic":"Visualisation","title old":"Show the data values in a static manner","title":"Show the data values","why":"Showing the data values in the visualisation allows readers to check the quality of the visualisation. This increases readability and trust in the visualisation. It also makes it possible for readers to reuse the data even if it is not available for download. ","how":"In static visualisations, the data values can be shown directly on the chart. If there is not enough space to show all data values, annotate the chart with the most important ones (e.g., minimum, maximum and most recent value). In interactive visualisations, a tool tip can be provided that shows the data values on hover.\n\nIn addition to showing the values in the visualisation, you can also show a data table. In a static publication format, the table can be shown below or next to the visualisation. In an interactive publication, you can allow the reader to switch between the chart and the table view.\n","resources":"","contacts":"","examples":"2,3","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 5D","topic":"Visualisation","title old":"Show the data values interactively","title":"","why":"Showing the data values in the visualisation allows readers to check the quality of the visualisation. This increases readability and trust in the visualisation. It also makes it possible for readers to reuse the data even if it is not available for download. ","how":"In static visualisations, the data values can be shown directly on the chart. If there is not enough space to show all data values, annotate the chart with the most important ones (e.g., minimum, maximum and most recent value). In interactive visualisations, a tool tip can be provided that shows the data values on hover.\n\nIn addition to showing the values in the visualisation, you can also show a data table. In a static publication format, the table can be shown below or next to the visualisation. In an interactive publication, you can allow the reader to switch between the chart and the table view.\n","resources":"","contacts":"","examples":"2,4","image":"","gallery-image":"","gallery-text":""},{"condition":"3A","topic":"Visualisation","title old":"Clearly identify the author of the visualisation","title":"Clearly identify the author of the visualisation","why":"Nowadays, visualisations from a publication can easily be reused: They might be added to a powerpoint presentation as a screenshot or be downloaded and posted on social media platforms. Because your visualisations might reappear in different contexts, it is best to cite the author in each chart.","how":"Make sure to clearly identify the organisation (or person) that created the visualisation. This is often done in a relatively small font size and / or in a lighter colour in the bottom right or left of the visualisation. If you provide the charts for download, you can also add your organisation's logo on the downloaded image of the chart.","resources":"","contacts":"","examples":"4,5","image":"","gallery-image":"","gallery-text":""},{"condition":"3A","topic":"Visualisation","title old":"Always cite the data source ","title":"Cite the data source","why":"Whether it is your own data or data from a third-party, always clearly identify the source of the data that was used to create the visualisation. As your visualisations might be reused in different contexts, it is best to cite the source with each chart. ","how":"As with the author, the source is usually shown in the bottom left or right of the chart in a relatively small font size. If possible, add a link to the source citation that leads directly to the processed data. The link to the entire database should be listed in the introduction section (see \"Structure\").\"\n\nBe consistent in the way you cite the data source. For example, you might decide to just use the name of the data provider (e.g., “JRC”); or you might use your own reference system to refer to the data source (e.g., as Eurostat does ).\n","resources":"117","contacts":"","examples":"6,8","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9B","topic":"Visualisation","title old":"Make sure to explicitly state that the visualisations cannot be reused ","title":"","why":"Be sure to clearly state that the visualisation cannot be reused (e.g., in the bottom right corner of each visualisation).","how":"","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9C","topic":"Visualisation","title old":"Check if your visualisations can be reused","title":"If necessary, clear the licensing right of your visualisations","why":"Visualisations, like text, images and whole publication, are intellectual property. Therefore, it is important to ensure that you can use a visualisation for your publication and figure out if the visualisations in your publication can be reused by others. ","how":"By default, all visualisations created by the European Commission are licensed under CC BY 4.0. This allows people to reuse the visualisation with proper attribution. If the visualisations are created by contractors, the (framework) contract regulates the intellectual property rights. If the visualisation is not created or commissioned by the EU, the reuse licence might be different and must be cleared with the original creator.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9C","topic":"Visualisation","title old":"State reuse licence","title":"State the reuse licence","why":"Readers of your publication – from policy makers to journalists – might want to reuse the visualisations from your publication. To support their efforts (and with that the further distribution of your work), clearly communicate under which terms the visualisation can be reused.  ","how":"","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9A && 12A","topic":"Publishing","title old":"Provide your visualisations as downloads","title":"Provide your visualisations as downloads","why":"Readers might want to reuse your publications for different situations. Providing an adequate way to download the visualisations will ensure that they don’t just screenshot them in a subpar quality.","how":"A few things to consider:\n-Format: If you want to provide a closed format offer a PNG. If you want to allow the users to edit the style of the visualisation you can additionally provide a vector-based format such as an SVG.\n-Aspect ratio: Different use cases call for different aspect ratios. Consider offering multiple aspect ratios, such as a 16:9 ratio for presentations and a 1:1 ratio for social media.\n-Usability: Users might want to download all the visualisations from the publication at once. Provide a zip-file with all files.\n-Provide adequate metadata: This image should contain metadata about the visualisation, e.g. which institution created it, the year, and link to the data behind it (see “Add appropriate meta data to your visualisation”).\n-State: If your visualisations are highly  interactive, make it possible to download the visualisation as it was filtered, sorted, and re-styled by the user.\n","resources":"","contacts":"","examples":"7,9","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 5D && 9A && 12A","topic":"Publishing","title old":"Provide your interactive visualisations as downloads","title":"","why":"Provide an image (a PNG or a JPEG) of the visualisation for people to download and reuse. This image should include metadata about the visualisation, e.g. which institution created it, the year, and link to the data behind it.","how":"If you want the user to be able to edit the visualisation provide an open, vector-based format such as an SVG in addition to the closed, pixel-based formats such as PNGs and JPEGs.\n\nYou might also want to offer different aspect ratios, such as a 16:9 ratio for presentations and a 1:1 ratio for social media.\n\nUsers might want to download all the visualisations and visualised tables from the report at once. Provide a link to a zip-file with all files in different formats.\n\nMake it possible to download the visualisation as it was filtered, sorted, and re-styled by the user: If the visualisation is interactive, the user might want to download the chart as they re-styled it, for example to use in a presentation or to post on social media.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9A && 12B","topic":"File Management","title old":"Find out where you can store your visualisations ","title":"","why":"Talk with your IT-department to find out where visualisation files are stored in your organisation.","how":"","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 9A && 12C","topic":"File Management","title old":"Find out about your institution's file management strategy","title":"","why":"Talk with your IT-department to find out how visualisation files might be managed in your organisation, i.e. where files are stored and how they are stored. ","how":"","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 5D","topic":"Visualisation","title old":"Decide the level of interactivity for each chart","title":"Decide which interactive functionalities to offer","why":"Many online charting tools come with integrated interactive functionalities and animations. These should not distract from the main message of the chart. Instead, they should offer the reader more information on demand and help them explore the visualisation. ","how":"If you are publishing an online publication, make a conscious decision on which interactive chart functionalities you want to offer. They can include:\n-Animations that play when the user scrolls to the chart: This feature is often distracting and should only be used if you are aiming for a playful display of your information.\n-Tooltip that shows underlying values: Tooltips help readers go into details and read the values without having to download the data. If you are using built-in tooltips, check if they are mobile-friendly.\n-Show, hide and highlight aspects of the data: This allows readers to set their own focus in the chart and is especially helpful for people who work with the information in your publication.\n-Control what data to show: These features range from a simple date filter to options to change the data source. More advanced features like the later, are usually more suited to a dashboard than to a linear publication with text and visualisations.\n-Change how the data is shown: These features allow users to change the chart type and chart design. They usually make the most sense in a dashboard setting.\n","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 5D","topic":"Visualisation","title old":"Provide interactive chart functionalities","title":"","why":"Provide options to change the data displayed in the visualisation and to sort and filter that data. ","how":"Provide options to change how the visualisation looks. The user might choose from different color palettes or change which data points are the highlighted.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"3A && 5D","topic":"Visualisation","title old":"Create visualisation designs for different screen sizes","title":"Create visualisation designs for different screen sizes","why":"Increasingly, content is consumed on smaller screens, i.e. mobile devices. This means that online content needs to responsively adjust to the screen size the reader is using. Data visualisations are no exception: They need to be designed in a way that layout and font-sizes responsively adjust to the width of the screen.","how":"Often interactive charting tools such as Highcharts come with built-in functionalities for responsive design. If not, check with your developers and designers for which screen sizes you are optimising. In terms of static charts, designers might create multiple versions for different platforms (e.g., one for the PDF-Publication and one for social media platforms).\n","resources":"","contacts":"","examples":"","image":"visualisation-screensizes","gallery-image":"","gallery-text":""},{"condition":"3A && 5D","topic":"Publishing","title old":"Provide options to reuse your visualisation on the web","title":"Provide options to embed your visualisation on other websites\n","why":"An embed code is a short script that can be copied and pasted into the code of another website. Embed codes allow others to reuse your web-based charts on their own sites.\n","how":"","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Publishing","title old":"","title":"Provide options to share your visualisation","why":"Sharing visualisations are a great way for people to reuse and discuss your work. Share options allow readers to share the visualisation on social media platforms, but can also allow them to copy a direct link to the visualisation and send it via email.\n","how":"Many charting tools include an option to provide share buttons alongside the visualisation. Only provide the sharing options that are relevant to your target audience, as to not overload the readers with possibilities.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Choose accessible colour combinations and fonts","why":"One in twelve men and one in two hundert women have some type of colour blindness. Many people also have poor eyesight or suffer from vision impairment. To make your charts more accessible on a visual level, choose accessible colour combinations and fonts.","how":"In choosing accessible fonts and colours, the keyword is “differentiation”. Colours for different categories should be easy to differentiate for people with different colour vision deficiencies. Don’t rely on colour alone to encode variables but add patterns and labels to ensure readability.\n\nChoose a font with characters that are easily distinguishable and are optimised for online reading.  Be sure that your font size isn’t any smaller than 12px.\n","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Write meaningful titles for your visualisations","why":"The title of a visualisation is usually the first – and sometimes the only – element the reader will look at. A meaningful title is a title that summarises the key findings shown in the chart. This helps guide readers through the data and makes the chart self-contained and reusable.","how":"In the title, try to summarise the main message of the visualisation in less than ten words. Use the subtitle to describe the data, its geography, the time period, and the units of measurement. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Write succinct visualisation legends","why":"Legends describe how different data variables are encoded in visual elements, thus serving as an instruction on how to read a visualisation. Legends are the key to understanding the visualisation and should therefore be created with considerable care. ","how":"Make sure to keep the wording in your legend consistent, succinct, and short. Defer from using abbreviations and complicated words. Finally, make sure that each visual element is explained. A good way to test if your legend works, is to show it to people outside of your field of expertise. Ask them to describe their thoughts out loud as they try to read the visualisation. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Annotate important features","why":"Annotations can guide readers towards important aspects of your data. They also provide context to the data, often explaining why certain developments, trends or changes show in the visualisation. ","how":"Identify salient features in your data visualisation: Is there a surprising development? Are there certain points that stand in contrast to the overall statement of the chart? Which features explicitly support the chart’s overall statement? Write short sentences or clauses to explain these features. Use arrows or lines to connect the feature with the annotation. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Make sure your interactive charts are accessible with the keyboard","why":"Not everyone can use a mouse to access content online. Therefore it is important to ensure that charts can be navigated with the keys alone (e.g. with the “Shift” and “Enter” keys). ","how":"Most interactive charting tools such as Highchart come with integrated keyboard navigation support. If you are using your own tools or implementing a new charting library, make sure to check and, if necessary, implement these features. ","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Keep future translations in mind","why":"In contrast to many other international bodies, the European Union is a multilingual organisation. All official languages of member states are also official EU languages. For one, this is to ensure that the general public and national courts can read and understand any applicable EU laws. For another, translated documents ensure democratic discussion and transparency.","how":"When creating a visualisation for a multilingual publication, keep in mind that titles, keys, labels and annotations must all be translated. It is therefore important to keep any text in the visualisation short and succinct. When providing the publication to the translation service, ensure that you provide enough context to avoid that short texts are mistranslated.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Makes use of official EU geodata for maps","why":"The mapping of areas, especially disputed areas, in an official context is an extremely sensitive issue. Carelessly plotted, designed, or labelled maps can cause far-reaching diplomatic incidents. The GISCO (Geographic Information System of the Commission)  team at Eurostat, together with DG COMM and the External Action Service of the EU, are responsible for correctly showing the official position of the EU on territorial conflicts.","how":"When making maps for your publications make use of GISCO’s resources. The GISCO team creates statistical and other thematic maps, manages a database of geographical information, and provides related services to the Commission.","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"","topic":"Visualisation","title old":"","title":"Add appropriate metadata to your visualisation\n","why":"Meta data not only ensures that visualisations are cited and attributed correctly, it also makes your charts accessible to people using screen readers and increases searchability online.\n","how":"Where and how you add metadata to you visualisations depends on which formats you are using:\n-Standalone visualisation (JPEG, TIFF, PNG): Images support IPTC metadata that can be viewed, added or modified with several tools, for example Adobe Bridge 2022.\n-Online publication: As metadata embedded in the standalone image files is not read out by screen readers it is good to use HTML-tags for image metadata online. A very important one is the <alt>-tag, which allows you to add descriptive text to the visualisation. If a reader is using the website in accessibility mode, this text will be read out by the screenreader. Charting tools often provide the option to add alt-text without the need to write any code yourself.\n-Static publication: In a Word-Manuscript you can add metadata to your visualisations by right-clicking on the image and selecting “Edit Alt Text”. This alt-text remains if the manuscript is converted into a PDF (as opposed to alt-text for tables which is not preserved).\n\nThe following information should always be provided in the metadata:\n-Title and subtitle\n-Description\n-Date\n-Author and source\n","resources":"","contacts":"","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"6A && (7A || 8A)","topic":"Publishing","title old":"Publish your datasets on data.europa.eu and your publications on OP portal","title":"Publish your data in a data catalogue","why":"A data catalogue is an inventory of data assets (e.g., databases, files, links). Through metadata and search tools, the catalogue allows data users to find and access the data they need. Data catalogues such as data.europa.eu do not host the data but link to where the data can be accessed.","how":"If your data is open data, you can catalogue it on data.europa.eu. To do so, make a request for data identifiers in DemPub. This is possible regardless if you're publishing the publication with the OP or not. Once the request is processed you will get a unique identifier for your data and the data will be included in the data.europa.eu catalogue. Even if the data cannot be released as open data you can publish on the internal EC data catalogue (commission-only).\n","resources":"84","contacts":"80","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"6A && (7B || 8B) || (7C || 8C)","topic":"Publishing","title old":"Consider publishing the data in your organisation's internal data catalogue (e.g. EC data catalogue)","title":"","why":"Even if the data cannot be released as open data, it is good practice to catalgue your data – either for internal or restricted public use. In case an internal data catalogue doesn't exist start with creating an inventory of your data.","how":"Data inventory and catalogue should use recommended standards (e.g. DCAT-AP, the data catalogue vocabulary for data portals in Europe)","resources":"24,21,9","contacts":"18","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"6B && (7A || 8A) || (7C || 8C)","topic":"Publishing","title old":"Consider aquiring identifiers through the Publications Office both for your data and for your publication","title":"","why":"Even if you are not using the OP to publish your publication, you can still use OP services to get a unique identifier. Use DemPub to make an identifiers only request. ","how":"","resources":"84","contacts":"80","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"6B && (7B || 8B)","topic":"Publishing","title old":"Consider aquiring identifiers through the Publications Office for your publication","title":"","why":"Even if you are not using the OP to publish your publication, you can still use OP services to get a unique identifier. Use DemPub to make an identifiers only request. ","how":"","resources":"84","contacts":"80","examples":"","image":"","gallery-image":"","gallery-text":""},{"condition":"6C","topic":"Publishing","title old":"Consider publishing with the Publications Office ","title":"","why":"The OP offers various additional and many free services related to publications and data. You may consult the online catalogue of OP services (PubliCare), and then request the ones you need using the platform DemPub.","how":"","resources":"83,84","contacts":"80","examples":"","image":"","gallery-image":"","gallery-text":""}]