[{"Condition":"","Topic":"Visualization","Suggestion / Recommendation":"Choose the right type of visualisation","Description":"Choose different visualisation types (e.g., bar chart, flow chart, diagram, etc.) depending on the data and on what aspects of your data you want to communicate.","Advanced considerations":"Once you have found the type you want to use (e.g. a line chart), make design amendments to communicate the information in your data more clearly (e.g. flip the chart 90 Degrees so that the lines run vertically). ","Resource IDs":"87,37","Contact IDs":"","Example IDs":"1"},{"Condition":"","Topic":"Visualization","Suggestion / Recommendation":"Follow best data visualisation practices","Description":"This includes using titles that summarize the main point of the visualisation, sub-headings that describe the units of measurement, precise legends / keys, consistent axes, and appropriate colors. It can also mean showing missing data, uncertainty ranges, trendlines and benchmarks, if the data calls for it. ","Advanced considerations":"","Resource IDs":"33","Contact IDs":"","Example IDs":"1"},{"Condition":"","Topic":"Visualization","Suggestion / Recommendation":"Provide the data values","Description":"Sometimes it might be important to know the exact value for each data point. In static visualisations, the data values can be shown directly on the chart. If there is not enough place to show all data values, annotate the chart with the most important ones (e.g., minimum, maximum and most recent value). ","Advanced considerations":"Provide the reader with a table view of the graphic. In a static publication format, the table can be shown below or next to the visualisation. ","Resource IDs":"","Contact IDs":"","Example IDs":"2,3"},{"Condition":"5D","Topic":"Visualization","Suggestion / Recommendation":"Provide the data values","Description":"Sometimes it might be important to know the exact value for each data point. In interactive graphics a tool tip can be provided that shows the data values on hover. In addition, you can annotate the chart with the most important ones (e.g., minimum, maximum and most recent value).   ","Advanced considerations":"Provide the reader with a table view of the graphic. In an interactive publication, allow the reader to switch between the chart and the table view.","Resource IDs":"","Contact IDs":"","Example IDs":"2,4"},{"Condition":"","Topic":"Visualization","Suggestion / Recommendation":"Clearly identify the author of the visualisation","Description":"Make sure to clearly identify the organisation (or person) that created the visualisation. Because your visualisations might be reused in different contexts, it is best to cite the author in each chart.","Advanced considerations":"Consider ensuring that your organisation's logo appears on the chart when downloaded.","Resource IDs":"","Contact IDs":"","Example IDs":"4,5"},{"Condition":"","Topic":"Visualization","Suggestion / Recommendation":"Always cite a data source ","Description":"Whether it is your own data or data from a third-party, always clearly identify the source of the data that was used to create the visualisation. As your visualisations might be reused in different contexts, it is best to cite the source with each chart. If possible, add a link that leads directly to that data set or to information on that data set. ","Advanced considerations":"Be consistent in the way you cite the data source. For example, you might decide to consistently use the name of the data owner and a link to the page that describes that data set.\n\nIn a comparative report, provide the source for each data value. ","Resource IDs":"","Contact IDs":"","Example IDs":"6,8"},{"Condition":"6A,8A","Topic":"Visualization","Suggestion / Recommendation":"Provide your visualisations as downloads","Description":"Provide an image (best format: PNG) of the visualisation for people to download and reuse. This image should contain metadata about the visualisation, e.g. which institution created it, the year, and link to the data behind it.","Advanced considerations":"If you want the user to be able to edit the visualisation provide an open, vector-based format such as an SVG in addition to the closed, pixel-based formats such as PNGs and JPEGs.\n\nYou might also want to offer different aspect ratios, such as a 16:9 ratio for presentations and a 1:1 ratio for social media. \n\nUsers might want to download all the visualisations and visualised tables from the report at once. Provide a link to a zip-file with all files in different formats. ","Resource IDs":"","Contact IDs":"","Example IDs":"7,9"},{"Condition":"6A,8B","Topic":"Visualization","Suggestion / Recommendation":"Build a Infrastructure","Description":"Do this and this","Advanced considerations":"","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"6B","Topic":"Visualization","Suggestion / Recommendation":"Build a Infrastructure","Description":"Do this and this","Advanced considerations":"","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"5D","Topic":"Visualization","Suggestion / Recommendation":"Provide the visualisations as downloads","Description":"Provide an image (a PNG or a JPEG) of the visualisation for people to download and reuse. This image should include metadata about the visualisation, e.g. which institution created it, the year, and link to the data behind it.","Advanced considerations":"If you want the user to be able to edit the visualisation provide an open, vector-based format such as an SVG in addition to the closed, pixel-based formats such as PNGs and JPEGs.\n\nYou might also want to offer different aspect ratios, such as a 16:9 ratio for presentations and a 1:1 ratio for social media. \n\nUsers might want to download all the visualisations and visualised tables from the report at once. Provide a link to a zip-file with all files in different formats. \n\nMake it possible to download the visualisation as it was filtered, sorted, and re-styled by the user: If the visualisation is interactive, the user might want to download the chart as they re-styled it, for example to use in a presentation or to post on social media.","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"5D","Topic":"Visualization","Suggestion / Recommendation":"Decide the level of interactivity for each chart","Description":"Many online charting tools come with integrated, default interactive features and sometimes also animations. These features do not always contribute to the legibility of the visualisations. It's always better to provide static, legible visualisations than distracting interactions that don't serve a purpose. ","Advanced considerations":"","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"5D","Topic":"Visualization","Suggestion / Recommendation":"Provide interactive chart functionalities","Description":"Provide options to change the data displayed in the visualisation and to sort and filter that data. ","Advanced considerations":"Provide options to change how the visualisation looks. The user might choose from different color palettes or change which data points are the highlighted.","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"5D","Topic":"Visualization","Suggestion / Recommendation":"Create visualisation designs for different screen sizes","Description":"Increasingly, content is consumed on smaller screens, i.e. mobile devices. This means that online content needs to responsively adjust to the screen size the reader is using. Data visualisations are no exception: They need to be designed for at least two different screen sizes (mobile and desktop) so that they remain legible across devices or be designed in a way that they responsively adjust to the width of the screen. ","Advanced considerations":"","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"5D","Topic":"Visualization","Suggestion / Recommendation":"Provide options to reuse your visualisation on the web","Description":"Provide an embed code for the visualisation so that users can add your chart to their websites. An embed code is a short script that can be copied and pasted into the code of another website. ","Advanced considerations":"Provide options to share the visualisation through share buttons. These allow people to share the visualisation directly on common social media platforms, e.g. instagram, twitter, facebook. \n","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"6A","Topic":"Data","Suggestion / Recommendation":"Follow open data practices in preparing your data","Description":"Open data practices include using a machine-readable data structure, and providing non-proprierty file formats, such as CSV or JSON.","Advanced considerations":"Consider providing linked open data. ","Resource IDs":"53,56,56,57,58","Contact IDs":"62","Example IDs":""},{"Condition":"6A","Topic":"Data","Suggestion / Recommendation":"Choose the right license for your data","Description":"In most cases, it is best to use the Creative Commons Attribution 4.0 International license (CC-BY 4.0) license for your data. This license allows users to \"copy, modify and distribute data in any format for any purpose, including commercial use. Users are only obligated to give appropriate credit (attribution) and indicate if they have made any changes, including translations.\" (Worldbank, 2020)","Advanced considerations":"There are many different licenses to choose from. Using a license chooser you can also try to find a license that is most specific to your situation than CC-BY 4.0 might be. ","Resource IDs":"3,1","Contact IDs":"5","Example IDs":""},{"Condition":"6A","Topic":"Data","Suggestion / Recommendation":"Describe your data in a standardized way","Description":"For you data to be findable, describe your data using the meta data scheme DCAT AP, the named authority list and controlled vocabulary of the EU. ","Advanced considerations":"Check if the meta data standard you are using is compatible with the OP data catalogue","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"6A","Topic":"Data","Suggestion / Recommendation":"Make sure that you provide enough documentation to your data","Description":"It is important to ensure that users can work with the data. The data documentation should include everything the user needs to know to work with the data, such as defintions, time ranges, and descriptions of the rows and columns. The documentation can be saved in a separate sheet in the Excel file that contains the actual data or be provided in a separate file. ","Advanced considerations":"","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"6C","Topic":"Data","Suggestion / Recommendation":"Find out if you can provide your data as open data","Description":"Data protection (GDPR) and licencing, open data advisory, contact open data team","Advanced considerations":"","Resource IDs":"","Contact IDs":"27,5,62","Example IDs":""},{"Condition":"6A,6C,8A","Topic":"Data","Suggestion / Recommendation":"Publish the data on your website for user to download it","Description":"On your website, provide the data for users to download. Link to this site from your publication. ","Advanced considerations":"Make it possible to download different scopes of your data. This can include, the entire data base, single data sets, and the data that is used in the visualisations (which has often been re-formated and aggregated for the visualisation).  This allows different types of users to reuse your data efficiently. ","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"6A||6C,8A","Topic":"Data","Suggestion / Recommendation":"Consider providing a programmatic interface to the data","Description":"If your organisation offers a lot of data, it might be worth considering an online application that allows your users to navigate, aggregate and download your data. In your publications, you can then link to certain views of the data (Eurostat calls these views \"Bookmarks\"). ","Advanced considerations":"","Resource IDs":"","Contact IDs":"","Example IDs":""},{"Condition":"6A||6C,8B","Topic":"Data","Suggestion / Recommendation":"Find out where you can host your data permanently","Description":"For an interime solution, contact the Open Data Team. If the amount of data is small, there will be solutions. ","Advanced considerations":"In the long-term consider creating the infrastructure to host your own data files. Especially if you have a lot of data. Start by talking to your ","Resource IDs":"53","Contact IDs":"62,18","Example IDs":""},{"Condition":"6A||6C,8C","Topic":"Data","Suggestion / Recommendation":"Find out about your institution's data management strategy","Description":"Talk with your data governance or IT-department to find out how data might be managed in your organisation, i.e. where data is stored and how it is stored. ","Advanced considerations":"","Resource IDs":"","Contact IDs":"13","Example IDs":""},{"Condition":"","Topic":"Data","Suggestion / Recommendation":"Use short, descriptive names for each data set.","Description":"Along offical identifiers, consider using a short name for the data set referenced in the publication. This is more recognizable to the reader and provides more information on the content of the data. ","Advanced considerations":"","Resource IDs":"","Contact IDs":"","Example IDs":""}]