[{"topic":"Structure","icon":"structure","title":"Structuring your publication","description":"Data and visualisations are important components in publications. The following tips suggest adding data-related sections and recommend ways to structure text and visualisations. This will make your publication pleasant to read and will allow others to reuse it and it's components."},{"topic":"Write","icon":"text","title":"Writing about data","description":"Writing about data or writing text for data visualisations is an important but often overlooked skill. This section details some tricks and tips on how to make your copy more reader friendly."},{"topic":"Visualise","icon":"visualisation","title":"Creating data visualisations","description":"Data visualisations present aspects of and insights from data in a visual manner. Good data visualisations serve a single, clearly defined purpose and can act as centrepieces to your line of reasoning. The following tips help you create understandable, accessible, and appealing data visualisations."},{"topic":"Prepare Visuals","icon":"visual","title":"Preparing visualisations for publishing","description":"Your visualisations might be reused in studies, shown in presentation slides, or shared on social media. This section provides advice on how to prepare the visualisations so that they can be found and reused by others."},{"topic":"Prepare Data","icon":"data","title":"Preparing data for publishing","description":"When public bodies share data openly, they increase transparency, accountability and value creation. Open data is data that anyone can access, use, modify and share for any purpose. In the case of the European Commission, documents and accompanying data are open data by default. Furthermore, whenever possible, they should be made available in machine-readable formats. The recommendations in this section guide you through publishing open data under the FAIR principles: making your data findable, accessible, interoperable and reusable."},{"topic":"Publish","icon":"publishing","title":"Publishing the data and the data visualisations with your publication","description":"The easiest way to publish your data is with the Publications Office of the European Union (OP). Through that publishing process you receive a unique identifier for your data and the data is included in the data.europa.eu catalogue. If you are publishing in another catalogue, you can still make use of OP services. You can consult PubliCare – the OP services catalogue – and request the services you need using Dempub."}]